[NoCoverage] ObjectLiteral
src/MVC/controller/BikeController.mjs:5:24
 
 import bikeDAO from "../dao/BikeDAO.mjs";
 
-const bikeController = {
-    findAll: async () => await bikeDAO.findAll(),
-}
+const bikeController = {}
 export default bikeController

[NoCoverage] ArrowFunction
src/MVC/controller/BikeController.mjs:6:14
 import bikeDAO from "../dao/BikeDAO.mjs";
 
 const bikeController = {
-    findAll: async () => await bikeDAO.findAll(),
+    findAll: () => undefined,
 }
 export default bikeController
