[NoCoverage] BlockStatement
src/Login.js:18:21
     const loginRef = useRef(null); // Référence au composant de connexion.
 
     // Effet pour gérer l'état de validation de la connexion.
-    useEffect(() => {
-        let newVarValue = "";
-
-        if (log === false) {
-            newVarValue = "INVALID";
-        } else if (log === true) {
-            newVarValue = "VALID";
-        }
-        setValid(newVarValue);
-    }, [log]);
+    useEffect(() => {}, [log]);
 
     // Effet pour appeler la fonction onLogin lorsque l'utilisateur est connecté.

[NoCoverage] ConditionalExpression
src/Login.js:21:13
     useEffect(() => {
         let newVarValue = "";
 
-        if (log === false) {
+        if (true) {
             newVarValue = "INVALID";
         } else if (log === true) {

[NoCoverage] BooleanLiteral
src/Login.js:21:21
     useEffect(() => {
         let newVarValue = "";
 
-        if (log === false) {
+        if (log === true) {
             newVarValue = "INVALID";
         } else if (log === true) {

[NoCoverage] StringLiteral
src/Login.js:22:27
         let newVarValue = "";
 
         if (log === false) {
-            newVarValue = "INVALID";
+            newVarValue = "";
         } else if (log === true) {
             newVarValue = "VALID";

[NoCoverage] BlockStatement
src/Login.js:23:34
 
         if (log === false) {
             newVarValue = "INVALID";
-        } else if (log === true) {
-            newVarValue = "VALID";
-        }
+        } else if (log === true) {}
         setValid(newVarValue);
     }, [log]);

[NoCoverage] BooleanLiteral
src/Login.js:23:28
 
         if (log === false) {
             newVarValue = "INVALID";
-        } else if (log === true) {
+        } else if (log === false) {
             newVarValue = "VALID";
         }

[NoCoverage] ArrayDeclaration
src/Login.js:27:8
             newVarValue = "VALID";
         }
         setValid(newVarValue);
-    }, [log]);
+    }, []);
 
     // Effet pour appeler la fonction onLogin lorsque l'utilisateur est connecté.

[NoCoverage] BlockStatement
src/Login.js:30:21
     }, [log]);
 
     // Effet pour appeler la fonction onLogin lorsque l'utilisateur est connecté.
-    useEffect(() => {
-        onLogin(loggedUser);
-    }, [loggedUser, onLogin]);
+    useEffect(() => {}, [loggedUser, onLogin]);
 
     // Effet pour fermer la boite de connexion lorsqu'un clic est effectué en dehors de celui-ci.

[NoCoverage] BlockStatement
src/Login.js:35:21
     }, [loggedUser, onLogin]);
 
     // Effet pour fermer la boite de connexion lorsqu'un clic est effectué en dehors de celui-ci.
-    useEffect(() => {
-        const handleClickOutside = (event) => {
-            if (loginRef.current && !loginRef.current.contains(event.target)) {
-                // Si le clic est en dehors de la boite Login, ferme la boite
-                setState(false);
-            }
-        };
-
-        // Ajoute un gestionnaire d'événements pour détecter les clics sur l'ensemble de la page
-        document.addEventListener('mousedown', handleClickOutside);
-
-        // Retire le gestionnaire d'événements lorsque le composant est démonté
-        return () => {
-            document.removeEventListener('mousedown', handleClickOutside);
-        };
-    }, []);
+    useEffect(() => {}, []);
 
     // Fonction pour gérer le processus de connexion.

[NoCoverage] BlockStatement
src/Login.js:36:47
 
     // Effet pour fermer la boite de connexion lorsqu'un clic est effectué en dehors de celui-ci.
     useEffect(() => {
-        const handleClickOutside = (event) => {
-            if (loginRef.current && !loginRef.current.contains(event.target)) {
-                // Si le clic est en dehors de la boite Login, ferme la boite
-                setState(false);
-            }
-        };
+        const handleClickOutside = (event) => {};
 
         // Ajoute un gestionnaire d'événements pour détecter les clics sur l'ensemble de la page

[NoCoverage] ConditionalExpression
src/Login.js:37:17
     // Effet pour fermer la boite de connexion lorsqu'un clic est effectué en dehors de celui-ci.
     useEffect(() => {
         const handleClickOutside = (event) => {
-            if (loginRef.current && !loginRef.current.contains(event.target)) {
+            if (false) {
                 // Si le clic est en dehors de la boite Login, ferme la boite
                 setState(false);

[NoCoverage] LogicalOperator
src/Login.js:37:17
     // Effet pour fermer la boite de connexion lorsqu'un clic est effectué en dehors de celui-ci.
     useEffect(() => {
         const handleClickOutside = (event) => {
-            if (loginRef.current && !loginRef.current.contains(event.target)) {
+            if (loginRef.current || !loginRef.current.contains(event.target)) {
                 // Si le clic est en dehors de la boite Login, ferme la boite
                 setState(false);

[NoCoverage] BooleanLiteral
src/Login.js:39:26
         const handleClickOutside = (event) => {
             if (loginRef.current && !loginRef.current.contains(event.target)) {
                 // Si le clic est en dehors de la boite Login, ferme la boite
-                setState(false);
+                setState(true);
             }
         };

[NoCoverage] BlockStatement
src/Login.js:47:22
         document.addEventListener('mousedown', handleClickOutside);
 
         // Retire le gestionnaire d'événements lorsque le composant est démonté
-        return () => {
-            document.removeEventListener('mousedown', handleClickOutside);
-        };
+        return () => {};
     }, []);
 

[NoCoverage] StringLiteral
src/Login.js:48:42
 
         // Retire le gestionnaire d'événements lorsque le composant est démonté
         return () => {
-            document.removeEventListener('mousedown', handleClickOutside);
+            document.removeEventListener("", handleClickOutside);
         };
     }, []);

[NoCoverage] EqualityOperator
src/Login.js:54:22
 
     // Fonction pour gérer le processus de connexion.
     const login = async () => {
-        const user = document.getElementById("login") == null ? null : document.getElementById("login").value;
+        const user = document.getElementById("login") != null ? null : document.getElementById("login").value;
         const password = document.getElementById("password") == null ? null : document.getElementById("password").value;
         try {

[NoCoverage] ConditionalExpression
src/Login.js:54:22
 
     // Fonction pour gérer le processus de connexion.
     const login = async () => {
-        const user = document.getElementById("login") == null ? null : document.getElementById("login").value;
+        const user = false ? null : document.getElementById("login").value;
         const password = document.getElementById("password") == null ? null : document.getElementById("password").value;
         try {

[NoCoverage] ConditionalExpression
src/Login.js:55:26
     // Fonction pour gérer le processus de connexion.
     const login = async () => {
         const user = document.getElementById("login") == null ? null : document.getElementById("login").value;
-        const password = document.getElementById("password") == null ? null : document.getElementById("password").value;
+        const password = true ? null : document.getElementById("password").value;
         try {
             const response = await fetch(`http://127.0.0.1:8080/api/v1/user/login`, {

[NoCoverage] ConditionalExpression
src/Login.js:55:26
     // Fonction pour gérer le processus de connexion.
     const login = async () => {
         const user = document.getElementById("login") == null ? null : document.getElementById("login").value;
-        const password = document.getElementById("password") == null ? null : document.getElementById("password").value;
+        const password = false ? null : document.getElementById("password").value;
         try {
             const response = await fetch(`http://127.0.0.1:8080/api/v1/user/login`, {

[NoCoverage] BlockStatement
src/Login.js:56:13
     const login = async () => {
         const user = document.getElementById("login") == null ? null : document.getElementById("login").value;
         const password = document.getElementById("password") == null ? null : document.getElementById("password").value;
-        try {
-            const response = await fetch(`http://127.0.0.1:8080/api/v1/user/login`, {
-                method: "POST",
-                body: JSON.stringify({
-                    login: user,
-                    password: password,
-                }),
-                headers: {
-                    "Content-Type": "application/json"
-                }
-            });
-
-            if (response.status === 200) {
-                setLog(true); // Définit l'état de connexion comme réussie.
-                document.getElementById("statut").innerHTML = "Login: " + user; // Affiche le nom d'utilisateur.
-                showCustomAlert("Vous êtes connecté !", "Connexion Alert"); // Affiche une alerte custom de connexion réussie.
-                setUser(await response.json()); // Enregistre les informations de l'utilisateur connecté.
-            } else {
-                setLog(false); // Définit l'état de connexion comme échouée.
-            }
-        } catch (error) {
+        try {} catch (error) {
             console.error("Erreur lors de l'envoi de la requête :", error);
         }

[NoCoverage] StringLiteral
src/Login.js:58:25
         const password = document.getElementById("password") == null ? null : document.getElementById("password").value;
         try {
             const response = await fetch(`http://127.0.0.1:8080/api/v1/user/login`, {
-                method: "POST",
+                method: "",
                 body: JSON.stringify({
                     login: user,

[NoCoverage] StringLiteral
src/Login.js:64:37
                     password: password,
                 }),
                 headers: {
-                    "Content-Type": "application/json"
+                    "Content-Type": ""
                 }
             });

[NoCoverage] ConditionalExpression
src/Login.js:68:17
                 }
             });
 
-            if (response.status === 200) {
+            if (false) {
                 setLog(true); // Définit l'état de connexion comme réussie.
                 document.getElementById("statut").innerHTML = "Login: " + user; // Affiche le nom d'utilisateur.

[NoCoverage] BooleanLiteral
src/Login.js:69:24
             });
 
             if (response.status === 200) {
-                setLog(true); // Définit l'état de connexion comme réussie.
+                setLog(false); // Définit l'état de connexion comme réussie.
                 document.getElementById("statut").innerHTML = "Login: " + user; // Affiche le nom d'utilisateur.
                 showCustomAlert("Vous êtes connecté !", "Connexion Alert"); // Affiche une alerte custom de connexion réussie.

[NoCoverage] BlockStatement
src/Login.js:73:20
                 document.getElementById("statut").innerHTML = "Login: " + user; // Affiche le nom d'utilisateur.
                 showCustomAlert("Vous êtes connecté !", "Connexion Alert"); // Affiche une alerte custom de connexion réussie.
                 setUser(await response.json()); // Enregistre les informations de l'utilisateur connecté.
-            } else {
-                setLog(false); // Définit l'état de connexion comme échouée.
-            }
+            } else {}
         } catch (error) {
             console.error("Erreur lors de l'envoi de la requête :", error);

[NoCoverage] BooleanLiteral
src/Login.js:74:24
                 showCustomAlert("Vous êtes connecté !", "Connexion Alert"); // Affiche une alerte custom de connexion réussie.
                 setUser(await response.json()); // Enregistre les informations de l'utilisateur connecté.
             } else {
-                setLog(false); // Définit l'état de connexion comme échouée.
+                setLog(true); // Définit l'état de connexion comme échouée.
             }
         } catch (error) {

[NoCoverage] BlockStatement
src/Login.js:76:25
             } else {
                 setLog(false); // Définit l'état de connexion comme échouée.
             }
-        } catch (error) {
-            console.error("Erreur lors de l'envoi de la requête :", error);
-        }
+        } catch (error) {}
     };
 

[NoCoverage] StringLiteral
src/Login.js:77:27
                 setLog(false); // Définit l'état de connexion comme échouée.
             }
         } catch (error) {
-            console.error("Erreur lors de l'envoi de la requête :", error);
+            console.error("", error);
         }
     };

[NoCoverage] EqualityOperator
src/Login.js:83:22
 
     // Fonction pour gérer le processus d'inscription.
     const register = async () => {
-        const user = document.getElementById("login") == null ? null : document.getElementById("login").value;
+        const user = document.getElementById("login") != null ? null : document.getElementById("login").value;
         const password = document.getElementById("password") == null ? null : document.getElementById("password").value;
         try {

[NoCoverage] ConditionalExpression
src/Login.js:83:22
 
     // Fonction pour gérer le processus d'inscription.
     const register = async () => {
-        const user = document.getElementById("login") == null ? null : document.getElementById("login").value;
+        const user = true ? null : document.getElementById("login").value;
         const password = document.getElementById("password") == null ? null : document.getElementById("password").value;
         try {

[NoCoverage] EqualityOperator
src/Login.js:84:26
     // Fonction pour gérer le processus d'inscription.
     const register = async () => {
         const user = document.getElementById("login") == null ? null : document.getElementById("login").value;
-        const password = document.getElementById("password") == null ? null : document.getElementById("password").value;
+        const password = document.getElementById("password") != null ? null : document.getElementById("password").value;
         try {
             const response = await fetch("http://127.0.0.1:8080/api/v1/user", {

[NoCoverage] BlockStatement
src/Login.js:85:13
     const register = async () => {
         const user = document.getElementById("login") == null ? null : document.getElementById("login").value;
         const password = document.getElementById("password") == null ? null : document.getElementById("password").value;
-        try {
-            const response = await fetch("http://127.0.0.1:8080/api/v1/user", {
-                method: "POST",
-                body: JSON.stringify({
-                    login: user,
-                    password: password,
-                }),
-                headers: {
-                    "Content-Type": "application/json"
-                }
-            });
-
-            if (response.status === 201) {
-                setLog(true); // Définit l'état de connexion comme réussie.
-                document.getElementById("statut").innerHTML = "Login: " + user; // Affiche le nom d'utilisateur.
-                showCustomAlert("Vous êtes connecté !", "Connexion Alert"); // Affiche une alerte de connexion réussie.
-                setUser({login: user, password: password}); // Enregistre les informations de l'utilisateur connecté.
-            } else {
-                setLog(false); // Définit l'état de connexion comme échouée.
-            }
-
-        } catch (error) {
+        try {} catch (error) {
             console.error("Erreur lors de l'envoi de la requête :", error);
         }

[NoCoverage] ObjectLiteral
src/Login.js:86:79
         const user = document.getElementById("login") == null ? null : document.getElementById("login").value;
         const password = document.getElementById("password") == null ? null : document.getElementById("password").value;
         try {
-            const response = await fetch("http://127.0.0.1:8080/api/v1/user", {
-                method: "POST",
-                body: JSON.stringify({
-                    login: user,
-                    password: password,
-                }),
-                headers: {
-                    "Content-Type": "application/json"
-                }
-            });
+            const response = await fetch("http://127.0.0.1:8080/api/v1/user", {});
 
             if (response.status === 201) {

[NoCoverage] StringLiteral
src/Login.js:86:42
         const user = document.getElementById("login") == null ? null : document.getElementById("login").value;
         const password = document.getElementById("password") == null ? null : document.getElementById("password").value;
         try {
-            const response = await fetch("http://127.0.0.1:8080/api/v1/user", {
+            const response = await fetch("", {
                 method: "POST",
                 body: JSON.stringify({

[NoCoverage] StringLiteral
src/Login.js:87:25
         const password = document.getElementById("password") == null ? null : document.getElementById("password").value;
         try {
             const response = await fetch("http://127.0.0.1:8080/api/v1/user", {
-                method: "POST",
+                method: "",
                 body: JSON.stringify({
                     login: user,

[NoCoverage] EqualityOperator
src/Login.js:97:17
                 }
             });
 
-            if (response.status === 201) {
+            if (response.status !== 201) {
                 setLog(true); // Définit l'état de connexion comme réussie.
                 document.getElementById("statut").innerHTML = "Login: " + user; // Affiche le nom d'utilisateur.

[NoCoverage] ConditionalExpression
src/Login.js:97:17
                 }
             });
 
-            if (response.status === 201) {
+            if (true) {
                 setLog(true); // Définit l'état de connexion comme réussie.
                 document.getElementById("statut").innerHTML = "Login: " + user; // Affiche le nom d'utilisateur.

[NoCoverage] BooleanLiteral
src/Login.js:98:24
             });
 
             if (response.status === 201) {
-                setLog(true); // Définit l'état de connexion comme réussie.
+                setLog(false); // Définit l'état de connexion comme réussie.
                 document.getElementById("statut").innerHTML = "Login: " + user; // Affiche le nom d'utilisateur.
                 showCustomAlert("Vous êtes connecté !", "Connexion Alert"); // Affiche une alerte de connexion réussie.

[NoCoverage] StringLiteral
src/Login.js:99:63
 
             if (response.status === 201) {
                 setLog(true); // Définit l'état de connexion comme réussie.
-                document.getElementById("statut").innerHTML = "Login: " + user; // Affiche le nom d'utilisateur.
+                document.getElementById("statut").innerHTML = "" + user; // Affiche le nom d'utilisateur.
                 showCustomAlert("Vous êtes connecté !", "Connexion Alert"); // Affiche une alerte de connexion réussie.
                 setUser({login: user, password: password}); // Enregistre les informations de l'utilisateur connecté.

[NoCoverage] ObjectLiteral
src/Login.js:101:25
                 setLog(true); // Définit l'état de connexion comme réussie.
                 document.getElementById("statut").innerHTML = "Login: " + user; // Affiche le nom d'utilisateur.
                 showCustomAlert("Vous êtes connecté !", "Connexion Alert"); // Affiche une alerte de connexion réussie.
-                setUser({login: user, password: password}); // Enregistre les informations de l'utilisateur connecté.
+                setUser({}); // Enregistre les informations de l'utilisateur connecté.
             } else {
                 setLog(false); // Définit l'état de connexion comme échouée.

[NoCoverage] BlockStatement
src/Login.js:102:20
                 document.getElementById("statut").innerHTML = "Login: " + user; // Affiche le nom d'utilisateur.
                 showCustomAlert("Vous êtes connecté !", "Connexion Alert"); // Affiche une alerte de connexion réussie.
                 setUser({login: user, password: password}); // Enregistre les informations de l'utilisateur connecté.
-            } else {
-                setLog(false); // Définit l'état de connexion comme échouée.
-            }
+            } else {}
 
         } catch (error) {

[NoCoverage] BlockStatement
src/Login.js:106:25
                 setLog(false); // Définit l'état de connexion comme échouée.
             }
 
-        } catch (error) {
-            console.error("Erreur lors de l'envoi de la requête :", error);
-        }
+        } catch (error) {}
     };
 

[NoCoverage] BlockStatement
src/Login.js:112:31
     };
 
     // Fonction pour fermer le composant de connexion.
-    const handleClose = () => {
-        setState(!state);
-    };
+    const handleClose = () => {};
 
     return (

[NoCoverage] BooleanLiteral
src/Login.js:113:18
 
     // Fonction pour fermer le composant de connexion.
     const handleClose = () => {
-        setState(!state);
+        setState(state);
     };
 

[NoCoverage] ConditionalExpression
src/Login.js:118:14
 
     return (
         <div>
-            {state && <div className="overlay"></div>}
+            {true}
             <div className={state ? 'login-box displayBlock' : 'login-box'} ref={loginRef}>
                 <h1>Login</h1>

[NoCoverage] ConditionalExpression
src/Login.js:118:14
 
     return (
         <div>
-            {state && <div className="overlay"></div>}
+            {false}
             <div className={state ? 'login-box displayBlock' : 'login-box'} ref={loginRef}>
                 <h1>Login</h1>

[NoCoverage] StringLiteral
src/Login.js:119:37
     return (
         <div>
             {state && <div className="overlay"></div>}
-            <div className={state ? 'login-box displayBlock' : 'login-box'} ref={loginRef}>
+            <div className={state ? "" : 'login-box'} ref={loginRef}>
                 <h1>Login</h1>
                 <span onClick={handleClose} className="close">&times;</span>
