[Killed] ObjectLiteral
src/MVC/dao/userDAO.mjs:9:36
 import bcrypt from "bcrypt";
 
 //Schema pour un user
-const schema = new mongoose.Schema({
-    login: {type: String, required: true},
-    password: {type: String, required: true},
-    avisdonnees: [avisSchema]
-})
+const schema = new mongoose.Schema({})
 const MongoUser = new mongoose.model('userCollection', schema)
 
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BooleanLiteral
src/MVC/dao/userDAO.mjs:10:37
 
 //Schema pour un user
 const schema = new mongoose.Schema({
-    login: {type: String, required: true},
+    login: {type: String, required: false},
     password: {type: String, required: true},
     avisdonnees: [avisSchema]
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BooleanLiteral
src/MVC/dao/userDAO.mjs:11:40
 //Schema pour un user
 const schema = new mongoose.Schema({
     login: {type: String, required: true},
-    password: {type: String, required: true},
+    password: {type: String, required: false},
     avisdonnees: [avisSchema]
 })
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ObjectLiteral
src/MVC/dao/userDAO.mjs:11:15
 //Schema pour un user
 const schema = new mongoose.Schema({
     login: {type: String, required: true},
-    password: {type: String, required: true},
+    password: {},
     avisdonnees: [avisSchema]
 })
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] StringLiteral
src/MVC/dao/userDAO.mjs:14:38
     password: {type: String, required: true},
     avisdonnees: [avisSchema]
 })
-const MongoUser = new mongoose.model('userCollection', schema)
+const MongoUser = new mongoose.model("", schema)
 
 const userDAO = {
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BlockStatement
src/MVC/dao/userDAO.mjs:19:26
 const userDAO = {
 
     //Renvoie un tableau de user
-    findAll: async () => {
-        const data = await MongoUser.find({},{_id:0})
-        return data.map((user) => new User(user))
-    },
+    findAll: async () => {},
     //Renvoie un user en fonction de son login ou null si il n'existe pas
     findByLogin: async (login) => {
killedBy: CalculMoyenne() no user
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/MVC/dao/userDAO.mjs:21:25
     //Renvoie un tableau de user
     findAll: async () => {
         const data = await MongoUser.find({},{_id:0})
-        return data.map((user) => new User(user))
+        return data.map(() => undefined)
     },
     //Renvoie un user en fonction de son login ou null si il n'existe pas
killedBy: CalculMoyenne() one user w/out review
statusReason: Cannot read properties of undefined (reading 'avisdonnees')

[Killed] BlockStatement
src/MVC/dao/userDAO.mjs:24:35
         return data.map((user) => new User(user))
     },
     //Renvoie un user en fonction de son login ou null si il n'existe pas
-    findByLogin: async (login) => {
-        let data = await MongoUser.findOne({login: login})
-        if (data != null)
-            data = new User(data)
-        return data
-    },
+    findByLogin: async (login) => {},
     //Ajoute un user si il n'existe pas déjà et si il est valide. Si oui le renvoie sinon une promise.reject
     add: async (user) => {
killedBy: findbyID() User introuvable
statusReason: expected undefined to deeply equal null

[Killed] EqualityOperator
src/MVC/dao/userDAO.mjs:26:13
     //Renvoie un user en fonction de son login ou null si il n'existe pas
     findByLogin: async (login) => {
         let data = await MongoUser.findOne({login: login})
-        if (data != null)
+        if (data == null)
             data = new User(data)
         return data
killedBy: CalculMoyenne() one user w/out review
statusReason: Cannot read properties of null (reading 'login')

[Killed] ConditionalExpression
src/MVC/dao/userDAO.mjs:26:13
     //Renvoie un user en fonction de son login ou null si il n'existe pas
     findByLogin: async (login) => {
         let data = await MongoUser.findOne({login: login})
-        if (data != null)
+        if (true)
             data = new User(data)
         return data
killedBy: CalculMoyenne() one user w/out review
statusReason: Cannot read properties of null (reading 'login')

[Killed] BlockStatement
src/MVC/dao/userDAO.mjs:31:26
         return data
     },
     //Ajoute un user si il n'existe pas déjà et si il est valide. Si oui le renvoie sinon une promise.reject
-    add: async (user) => {
-        if (await userDAO.findByLogin(user.login))
-            return Promise.reject("User already exists")
-        try {
-            const login =user.login
-            const hashedPassword = await bcrypt.hash(user.password, 10)
-            const newUser = new User({login:login,password: hashedPassword,avisdonnees:user.avisdonnees})
-            const mongoUser = new MongoUser({...newUser})
-            await mongoUser.save()
-            return await userDAO.findByLogin(user.login)
-        } catch (e) {
-            return Promise.reject("Not a valid user")
-        }
-    },
+    add: async (user) => {},
     //Ajoute un avis dans user si le user existe. Si un avis existe déjà pour cette toilette il est remplacer
     addAvis: async (idToilette,login,note) =>{
killedBy: CalculMoyenne() one user w/ one review [match]
statusReason: expected -1 to deeply equal 3

[Killed] ConditionalExpression
src/MVC/dao/userDAO.mjs:32:13
     },
     //Ajoute un user si il n'existe pas déjà et si il est valide. Si oui le renvoie sinon une promise.reject
     add: async (user) => {
-        if (await userDAO.findByLogin(user.login))
+        if (false)
             return Promise.reject("User already exists")
         try {
killedBy: GET /user POST /user an existing user
statusReason: expected 201 to deeply equal 400

[Killed] ConditionalExpression
src/MVC/dao/userDAO.mjs:32:13
     },
     //Ajoute un user si il n'existe pas déjà et si il est valide. Si oui le renvoie sinon une promise.reject
     add: async (user) => {
-        if (await userDAO.findByLogin(user.login))
+        if (true)
             return Promise.reject("User already exists")
         try {
killedBy: CalculMoyenne() one user w/out review
statusReason: the string "User already exists" was thrown, throw an Error :)

[Killed] BlockStatement
src/MVC/dao/userDAO.mjs:34:13
     add: async (user) => {
         if (await userDAO.findByLogin(user.login))
             return Promise.reject("User already exists")
-        try {
-            const login =user.login
-            const hashedPassword = await bcrypt.hash(user.password, 10)
-            const newUser = new User({login:login,password: hashedPassword,avisdonnees:user.avisdonnees})
-            const mongoUser = new MongoUser({...newUser})
-            await mongoUser.save()
-            return await userDAO.findByLogin(user.login)
-        } catch (e) {
+        try {} catch (e) {
             return Promise.reject("Not a valid user")
         }
killedBy: CalculMoyenne() one user w/ one review [match]
statusReason: expected -1 to deeply equal 3

[Killed] BlockStatement
src/MVC/dao/userDAO.mjs:41:21
             const mongoUser = new MongoUser({...newUser})
             await mongoUser.save()
             return await userDAO.findByLogin(user.login)
-        } catch (e) {
-            return Promise.reject("Not a valid user")
-        }
+        } catch (e) {}
     },
     //Ajoute un avis dans user si le user existe. Si un avis existe déjà pour cette toilette il est remplacer
killedBy: GET /user POST /user add a invalid user wrong attribut
statusReason: expected 201 to deeply equal 400

[Killed] BlockStatement
src/MVC/dao/userDAO.mjs:46:46
         }
     },
     //Ajoute un avis dans user si le user existe. Si un avis existe déjà pour cette toilette il est remplacer
-    addAvis: async (idToilette,login,note) =>{
-        const data = await userDAO.findByLogin(login)
-        if (data != null){
-            let tab = data.avisdonnees
-            if (tab == undefined){
-                tab = []
-            }
-            //Supprime les doublons
-            let newtab = []
-            for (let i = 0; i<tab.length; i++){
-                if (tab[i].idToilette != idToilette){
-                    newtab.push(tab[i])
-                }
-            }
-            tab = newtab
-            tab.push({idToilette:idToilette,ranking:note})
-            await MongoUser.updateOne({login:data.login}, {$set:{avisdonnees:tab}})
-            const toilet = await toiletteDAO.findById(idToilette)
-            await toilet.calculMoyenne()
-            return MongoUser.findOne({login:login},{_id:0,__v:0,'avisdonnees._id':0})
-        }else {
-            return null
-        }
-    },
+    addAvis: async (idToilette,login,note) =>{},
     //Prend un login et un password hasher et verifie si ils sont présent dans la BD
     verifLogin: async (login,password) =>{
killedBy: addAvis() Avis non ajouté
statusReason: expected undefined to deeply equal null

[Killed] EqualityOperator
src/MVC/dao/userDAO.mjs:48:13
     //Ajoute un avis dans user si le user existe. Si un avis existe déjà pour cette toilette il est remplacer
     addAvis: async (idToilette,login,note) =>{
         const data = await userDAO.findByLogin(login)
-        if (data != null){
+        if (data == null){
             let tab = data.avisdonnees
             if (tab == undefined){
killedBy: addAvis() Avis non ajouté
statusReason: Cannot read properties of null (reading 'avisdonnees')

[Killed] ConditionalExpression
src/MVC/dao/userDAO.mjs:48:13
     //Ajoute un avis dans user si le user existe. Si un avis existe déjà pour cette toilette il est remplacer
     addAvis: async (idToilette,login,note) =>{
         const data = await userDAO.findByLogin(login)
-        if (data != null){
+        if (true){
             let tab = data.avisdonnees
             if (tab == undefined){
killedBy: addAvis() Avis non ajouté
statusReason: Cannot read properties of null (reading 'avisdonnees')

[Survived] ConditionalExpression
src/MVC/dao/userDAO.mjs:50:17
         const data = await userDAO.findByLogin(login)
         if (data != null){
             let tab = data.avisdonnees
-            if (tab == undefined){
+            if (false){
                 tab = []
             }

[Survived] ConditionalExpression
src/MVC/dao/userDAO.mjs:50:17
         const data = await userDAO.findByLogin(login)
         if (data != null){
             let tab = data.avisdonnees
-            if (tab == undefined){
+            if (true){
                 tab = []
             }

[Killed] ArrayDeclaration
src/MVC/dao/userDAO.mjs:54:26
                 tab = []
             }
             //Supprime les doublons
-            let newtab = []
+            let newtab = ["Stryker was here"]
             for (let i = 0; i<tab.length; i++){
                 if (tab[i].idToilette != idToilette){
killedBy: addAvis() Avis ajouté
statusReason: Cast to embedded failed for value "Stryker was here" (type string) at path "avisdonnees" because of "ObjectParameterError"

[Killed] EqualityOperator
src/MVC/dao/userDAO.mjs:55:29
             }
             //Supprime les doublons
             let newtab = []
-            for (let i = 0; i<tab.length; i++){
+            for (let i = 0; i <= tab.length; i++){
                 if (tab[i].idToilette != idToilette){
                     newtab.push(tab[i])
killedBy: addAvis() Avis ajouté
statusReason: Cannot read properties of undefined (reading 'idToilette')

[Killed] UpdateOperator
src/MVC/dao/userDAO.mjs:55:43
             }
             //Supprime les doublons
             let newtab = []
-            for (let i = 0; i<tab.length; i++){
+            for (let i = 0; i<tab.length; i--){
                 if (tab[i].idToilette != idToilette){
                     newtab.push(tab[i])
killedBy: GET /user GET /user add second review on same toilet
statusReason: expected 400 to deeply equal 200

[Killed] EqualityOperator
src/MVC/dao/userDAO.mjs:56:21
             //Supprime les doublons
             let newtab = []
             for (let i = 0; i<tab.length; i++){
-                if (tab[i].idToilette != idToilette){
+                if (tab[i].idToilette == idToilette){
                     newtab.push(tab[i])
                 }
killedBy: GET /user GET /user add second review on same toilet
statusReason: expected [ { idToilette: 1, ranking: 2 }, …(1) ] to deeply equal [ { idToilette: 1, ranking: 4 } ]

[Killed] ConditionalExpression
src/MVC/dao/userDAO.mjs:56:21
             //Supprime les doublons
             let newtab = []
             for (let i = 0; i<tab.length; i++){
-                if (tab[i].idToilette != idToilette){
+                if (true){
                     newtab.push(tab[i])
                 }
killedBy: GET /user GET /user add second review on same toilet
statusReason: expected [ { idToilette: 1, ranking: 2 }, …(1) ] to deeply equal [ { idToilette: 1, ranking: 4 } ]

[Killed] ObjectLiteral
src/MVC/dao/userDAO.mjs:61:22
                 }
             }
             tab = newtab
-            tab.push({idToilette:idToilette,ranking:note})
+            tab.push({})
             await MongoUser.updateOne({login:data.login}, {$set:{avisdonnees:tab}})
             const toilet = await toiletteDAO.findById(idToilette)
killedBy: addAvis() Avis ajouté
statusReason: expected [ { idToilette: undefined, …(1) } ] to deeply equal [ { idToilette: 1, ranking: 5 } ]

[Killed] ObjectLiteral
src/MVC/dao/userDAO.mjs:62:59
             }
             tab = newtab
             tab.push({idToilette:idToilette,ranking:note})
-            await MongoUser.updateOne({login:data.login}, {$set:{avisdonnees:tab}})
+            await MongoUser.updateOne({login:data.login}, {})
             const toilet = await toiletteDAO.findById(idToilette)
             await toilet.calculMoyenne()
killedBy: addAvis() Avis ajouté
statusReason: expected [] to deeply equal [ { idToilette: 1, ranking: 5 } ]

[Survived] ObjectLiteral
src/MVC/dao/userDAO.mjs:65:38
             await MongoUser.updateOne({login:data.login}, {$set:{avisdonnees:tab}})
             const toilet = await toiletteDAO.findById(idToilette)
             await toilet.calculMoyenne()
-            return MongoUser.findOne({login:login},{_id:0,__v:0,'avisdonnees._id':0})
+            return MongoUser.findOne({},{_id:0,__v:0,'avisdonnees._id':0})
         }else {
             return null

[Killed] BlockStatement
src/MVC/dao/userDAO.mjs:66:15
             const toilet = await toiletteDAO.findById(idToilette)
             await toilet.calculMoyenne()
             return MongoUser.findOne({login:login},{_id:0,__v:0,'avisdonnees._id':0})
-        }else {
-            return null
-        }
+        }else {}
     },
     //Prend un login et un password hasher et verifie si ils sont présent dans la BD
killedBy: addAvis() Avis non ajouté
statusReason: expected undefined to deeply equal null

[Killed] BlockStatement
src/MVC/dao/userDAO.mjs:71:42
         }
     },
     //Prend un login et un password hasher et verifie si ils sont présent dans la BD
-    verifLogin: async (login,password) =>{
-        let data =  await userDAO.findByLogin(login)
-        if (data != null) {
-            if (await bcrypt.compare(password, data.password)) {
-                return new User(data)
-            } else {
-                return Promise.reject("Invalid password")
-            }
-        }
-        return Promise.reject("Invalid user")
-    },
+    verifLogin: async (login,password) =>{},
 
     //Methode de test pour généré des faux user
killedBy: GET /user POST /user/login log an invalid user
statusReason: expected 200 to deeply equal 404

[Killed] EqualityOperator
src/MVC/dao/userDAO.mjs:73:13
     //Prend un login et un password hasher et verifie si ils sont présent dans la BD
     verifLogin: async (login,password) =>{
         let data =  await userDAO.findByLogin(login)
-        if (data != null) {
+        if (data == null) {
             if (await bcrypt.compare(password, data.password)) {
                 return new User(data)
killedBy: GET /user POST /user/login log an existing user
statusReason: expected 404 to deeply equal 200

[Killed] BlockStatement
src/MVC/dao/userDAO.mjs:73:27
     //Prend un login et un password hasher et verifie si ils sont présent dans la BD
     verifLogin: async (login,password) =>{
         let data =  await userDAO.findByLogin(login)
-        if (data != null) {
-            if (await bcrypt.compare(password, data.password)) {
-                return new User(data)
-            } else {
-                return Promise.reject("Invalid password")
-            }
-        }
+        if (data != null) {}
         return Promise.reject("Invalid user")
     },
killedBy: GET /user POST /user/login log an existing user
statusReason: expected 404 to deeply equal 200

[Killed] ConditionalExpression
src/MVC/dao/userDAO.mjs:74:17
     verifLogin: async (login,password) =>{
         let data =  await userDAO.findByLogin(login)
         if (data != null) {
-            if (await bcrypt.compare(password, data.password)) {
+            if (false) {
                 return new User(data)
             } else {
killedBy: GET /user POST /user/login log an existing user
statusReason: expected 404 to deeply equal 200

[Killed] ConditionalExpression
src/MVC/dao/userDAO.mjs:74:17
     verifLogin: async (login,password) =>{
         let data =  await userDAO.findByLogin(login)
         if (data != null) {
-            if (await bcrypt.compare(password, data.password)) {
+            if (true) {
                 return new User(data)
             } else {
killedBy: GET /user POST /user/login log an invalid user
statusReason: expected 200 to deeply equal 404

[Survived] BlockStatement
src/MVC/dao/userDAO.mjs:76:20
         if (data != null) {
             if (await bcrypt.compare(password, data.password)) {
                 return new User(data)
-            } else {
-                return Promise.reject("Invalid password")
-            }
+            } else {}
         }
         return Promise.reject("Invalid user")

[Survived] StringLiteral
src/MVC/dao/userDAO.mjs:77:39
             if (await bcrypt.compare(password, data.password)) {
                 return new User(data)
             } else {
-                return Promise.reject("Invalid password")
+                return Promise.reject("")
             }
         }

[NoCoverage] StringLiteral
src/MVC/dao/userDAO.mjs:80:31
                 return Promise.reject("Invalid password")
             }
         }
-        return Promise.reject("Invalid user")
+        return Promise.reject("")
     },
 

[NoCoverage] BlockStatement
src/MVC/dao/userDAO.mjs:87:38
     fakeDonneesGenerate: async () => {
         await MongoUser.deleteMany({})
         let toiletteData = await toiletteDAO.findAll()
-        for (let a = 0; a < 11; a++) {
-
-            let password=bcrypt.hash("pass"+(a*2).toString(),10)
-            let tabavis = []
-
-
-            let randomInteger = Math.floor(Math.random() * 6 )
-            let randomcommence = Math.floor(Math.random() * 27)
-            for (let j = randomcommence; j < randomcommence+randomInteger; j++) {
-                let random = Math.random() * 4 +1
-                let newAvis = {
-                    idToilette: toiletteData[j].identifiant,
-                    ranking: random
-                }
-                tabavis.push(newAvis)
-
-            }
-            let unUser={
-                login:(a+1).toString(),
-                password:password,
-                avisdonnees:tabavis
-
-            }
-            await MongoUser.collection.insertOne({...unUser})
-        }
+        for (let a = 0; a < 11; a++) {}
         let toiletteData2 = await toiletteDAO.findAll()
 

[NoCoverage] EqualityOperator
src/MVC/dao/userDAO.mjs:87:25
     fakeDonneesGenerate: async () => {
         await MongoUser.deleteMany({})
         let toiletteData = await toiletteDAO.findAll()
-        for (let a = 0; a < 11; a++) {
+        for (let a = 0; a <= 11; a++) {
 
             let password=bcrypt.hash("pass"+(a*2).toString(),10)

[NoCoverage] ArithmeticOperator
src/MVC/dao/userDAO.mjs:89:46
         let toiletteData = await toiletteDAO.findAll()
         for (let a = 0; a < 11; a++) {
 
-            let password=bcrypt.hash("pass"+(a*2).toString(),10)
+            let password=bcrypt.hash("pass"+(a / 2).toString(),10)
             let tabavis = []
 

[NoCoverage] ArithmeticOperator
src/MVC/dao/userDAO.mjs:93:44
             let tabavis = []
 
 
-            let randomInteger = Math.floor(Math.random() * 6 )
+            let randomInteger = Math.floor(Math.random() / 6 )
             let randomcommence = Math.floor(Math.random() * 27)
             for (let j = randomcommence; j < randomcommence+randomInteger; j++) {

[NoCoverage] ArithmeticOperator
src/MVC/dao/userDAO.mjs:94:45
 
 
             let randomInteger = Math.floor(Math.random() * 6 )
-            let randomcommence = Math.floor(Math.random() * 27)
+            let randomcommence = Math.floor(Math.random() / 27)
             for (let j = randomcommence; j < randomcommence+randomInteger; j++) {
                 let random = Math.random() * 4 +1

[NoCoverage] EqualityOperator
src/MVC/dao/userDAO.mjs:95:42
 
             let randomInteger = Math.floor(Math.random() * 6 )
             let randomcommence = Math.floor(Math.random() * 27)
-            for (let j = randomcommence; j < randomcommence+randomInteger; j++) {
+            for (let j = randomcommence; j >= randomcommence + randomInteger; j++) {
                 let random = Math.random() * 4 +1
                 let newAvis = {

[NoCoverage] ConditionalExpression
src/MVC/dao/userDAO.mjs:95:42
 
             let randomInteger = Math.floor(Math.random() * 6 )
             let randomcommence = Math.floor(Math.random() * 27)
-            for (let j = randomcommence; j < randomcommence+randomInteger; j++) {
+            for (let j = randomcommence; false; j++) {
                 let random = Math.random() * 4 +1
                 let newAvis = {

[NoCoverage] ArithmeticOperator
src/MVC/dao/userDAO.mjs:96:30
             let randomInteger = Math.floor(Math.random() * 6 )
             let randomcommence = Math.floor(Math.random() * 27)
             for (let j = randomcommence; j < randomcommence+randomInteger; j++) {
-                let random = Math.random() * 4 +1
+                let random = Math.random() * 4 - 1
                 let newAvis = {
                     idToilette: toiletteData[j].identifiant,

[NoCoverage] ArithmeticOperator
src/MVC/dao/userDAO.mjs:96:30
             let randomInteger = Math.floor(Math.random() * 6 )
             let randomcommence = Math.floor(Math.random() * 27)
             for (let j = randomcommence; j < randomcommence+randomInteger; j++) {
-                let random = Math.random() * 4 +1
+                let random = Math.random() / 4 +1
                 let newAvis = {
                     idToilette: toiletteData[j].identifiant,

[NoCoverage] ArithmeticOperator
src/MVC/dao/userDAO.mjs:105:24
 
             }
             let unUser={
-                login:(a+1).toString(),
+                login:(a - 1).toString(),
                 password:password,
                 avisdonnees:tabavis

[NoCoverage] ArrowFunction
src/MVC/dao/userDAO.mjs:114:34
         }
         let toiletteData2 = await toiletteDAO.findAll()
 
-        return toiletteData2.map(avis => new Avis(avis))
+        return toiletteData2.map(() => undefined)
     },
     //Supprime tous les users

[Survived] BlockStatement
src/MVC/dao/userDAO.mjs:117:26
         return toiletteData2.map(avis => new Avis(avis))
     },
     //Supprime tous les users
-    deleteAll: async ()=>{
-        await MongoUser.deleteMany({})
-    }
+    deleteAll: async ()=>{}
 }
 export default userDAO
