[Killed] StringLiteral
src/MVC/route/route.mjs:14:12
 const router = express.Router()
 
 router
-    .route('/bike')
+    .route("")
     .get(async (req, res) =>{
         // #swagger.summary = 'renvoie tous les vélo'
killedBy: GET /bike GET /bike
statusReason: expected 404 to deeply equal 200

[Timeout] BlockStatement
src/MVC/route/route.mjs:15:29
 
 router
     .route('/bike')
-    .get(async (req, res) =>{
-        // #swagger.summary = 'renvoie tous les vélo'
-        // #swagger.description = 'renvoie tous les vélo'
-
-        res.status(200).send(await BikeController.findAll())
-    })
+    .get(async (req, res) =>{})
 
 router

[Timeout] BlockStatement
src/MVC/route/route.mjs:24:29
 
 router
     .route('/wc')
-    .get(async (req, res) =>{
-        // #swagger.summary = 'renvoie tous les WC'
-        // #swagger.description = 'renvoie tous les WC'
-
-        res.status(200).send(await toiletteController.findAll())
-    })
+    .get(async (req, res) =>{})
     .post(async (req,res)=>{
         // #swagger.summary = 'ajoute un WC'

[Timeout] BlockStatement
src/MVC/route/route.mjs:30:28
 
         res.status(200).send(await toiletteController.findAll())
     })
-    .post(async (req,res)=>{
-        // #swagger.summary = 'ajoute un WC'
-        // #swagger.description = 'ajoute un WC'
-        try {
-            const newtoilet = new ToilettesModel({identifiant:req.body.identifiant,nom:req.body.nom,latitude:req.body.latitude,longitude:req.body.longitude,ranking:-1,nbr_avis:0})
-            const toilet = toiletteController.add(newtoilet)
-            res.status(201).send(toilet)
-        }catch (e) {
-            return res.status(400).send({message: 'not added'})
-        }
-    })
+    .post(async (req,res)=>{})
 router
     .route('/wc/:idToilette')

[Timeout] BlockStatement
src/MVC/route/route.mjs:33:13
     .post(async (req,res)=>{
         // #swagger.summary = 'ajoute un WC'
         // #swagger.description = 'ajoute un WC'
-        try {
-            const newtoilet = new ToilettesModel({identifiant:req.body.identifiant,nom:req.body.nom,latitude:req.body.latitude,longitude:req.body.longitude,ranking:-1,nbr_avis:0})
-            const toilet = toiletteController.add(newtoilet)
-            res.status(201).send(toilet)
-        }catch (e) {
+        try {}catch (e) {
             return res.status(400).send({message: 'not added'})
         }

[Killed] UnaryOperator
src/MVC/route/route.mjs:34:165
         // #swagger.summary = 'ajoute un WC'
         // #swagger.description = 'ajoute un WC'
         try {
-            const newtoilet = new ToilettesModel({identifiant:req.body.identifiant,nom:req.body.nom,latitude:req.body.latitude,longitude:req.body.longitude,ranking:-1,nbr_avis:0})
+            const newtoilet = new ToilettesModel({identifiant:req.body.identifiant,nom:req.body.nom,latitude:req.body.latitude,longitude:req.body.longitude,ranking:+1,nbr_avis:0})
             const toilet = toiletteController.add(newtoilet)
             res.status(201).send(toilet)
killedBy: GET /wc GET /wc/1 toilet exist
statusReason: expected { identifiant: 1, …(5) } to deeply equal { identifiant: 1, …(5) }

[NoCoverage] BlockStatement
src/MVC/route/route.mjs:37:20
             const newtoilet = new ToilettesModel({identifiant:req.body.identifiant,nom:req.body.nom,latitude:req.body.latitude,longitude:req.body.longitude,ranking:-1,nbr_avis:0})
             const toilet = toiletteController.add(newtoilet)
             res.status(201).send(toilet)
-        }catch (e) {
-            return res.status(400).send({message: 'not added'})
-        }
+        }catch (e) {}
     })
 router

[NoCoverage] StringLiteral
src/MVC/route/route.mjs:38:51
             const toilet = toiletteController.add(newtoilet)
             res.status(201).send(toilet)
         }catch (e) {
-            return res.status(400).send({message: 'not added'})
+            return res.status(400).send({message: ""})
         }
     })

[Timeout] BlockStatement
src/MVC/route/route.mjs:43:29
     })
 router
     .route('/wc/:idToilette')
-    .get(async (req, res) =>{
-        // #swagger.summary = 'renvoie un WC en fonction de son id'
-        // #swagger.description = 'renvoie un WC en fonction de son id'
-        const myId = decodeURIComponent(req.params.idToilette)
-        const monToilette = await toiletteController.findById(myId)
-        if (monToilette==null)
-            return res.status(404).send({message: "Toilette Non Trouvé"})
-        else
-            return res.status(200).send(monToilette)
-
-    })
+    .get(async (req, res) =>{})
 router
     .route('/user')

[Killed] ConditionalExpression
src/MVC/route/route.mjs:48:13
         // #swagger.description = 'renvoie un WC en fonction de son id'
         const myId = decodeURIComponent(req.params.idToilette)
         const monToilette = await toiletteController.findById(myId)
-        if (monToilette==null)
+        if (false)
             return res.status(404).send({message: "Toilette Non Trouvé"})
         else
killedBy: GET /wc GET /wc/1 toilet not found
statusReason: expected 200 to deeply equal 404

[Killed] EqualityOperator
src/MVC/route/route.mjs:48:13
         // #swagger.description = 'renvoie un WC en fonction de son id'
         const myId = decodeURIComponent(req.params.idToilette)
         const monToilette = await toiletteController.findById(myId)
-        if (monToilette==null)
+        if (monToilette != null)
             return res.status(404).send({message: "Toilette Non Trouvé"})
         else
killedBy: GET /wc GET /wc/1 toilet not found
statusReason: expected 200 to deeply equal 404

[Timeout] BlockStatement
src/MVC/route/route.mjs:56:29
     })
 router
     .route('/user')
-    .get(async (req, res) =>{
-        // #swagger.summary = 'renvoie tous les users'
-        // #swagger.description = 'renvoie tous les users'
-        res.status(200).send(await userController.findAll())})
+    .get(async (req, res) =>{})
     .post(async (req, res) =>{
         // #swagger.summary = 'ajoute un user'

[Timeout] BlockStatement
src/MVC/route/route.mjs:60:30
         // #swagger.summary = 'renvoie tous les users'
         // #swagger.description = 'renvoie tous les users'
         res.status(200).send(await userController.findAll())})
-    .post(async (req, res) =>{
-        // #swagger.summary = 'ajoute un user'
-        // #swagger.description = 'ajoute un user si il est valide et qu'il n'existe pas déjà'
-        try {
-
-            const newUser = new User({login:req.body.login,password:req.body.password,avisdonnees:[]})
-            const user = await  userController.add(newUser)
-            return res.status(201).send(user)
-        }
-        catch (e) {
-            return res.status(400).send({message: 'not added'})
-        }
-    })
+    .post(async (req, res) =>{})
     .delete(async (req,res)=> {
         // #swagger.summary = 'supprime tous les users'

[Timeout] BlockStatement
src/MVC/route/route.mjs:63:13
     .post(async (req, res) =>{
         // #swagger.summary = 'ajoute un user'
         // #swagger.description = 'ajoute un user si il est valide et qu'il n'existe pas déjà'
-        try {
-
-            const newUser = new User({login:req.body.login,password:req.body.password,avisdonnees:[]})
-            const user = await  userController.add(newUser)
-            return res.status(201).send(user)
-        }
+        try {}
         catch (e) {
             return res.status(400).send({message: 'not added'})

[Timeout] BlockStatement
src/MVC/route/route.mjs:69:19
             const user = await  userController.add(newUser)
             return res.status(201).send(user)
         }
-        catch (e) {
-            return res.status(400).send({message: 'not added'})
-        }
+        catch (e) {}
     })
     .delete(async (req,res)=> {

[Killed] StringLiteral
src/MVC/route/route.mjs:70:51
             return res.status(201).send(user)
         }
         catch (e) {
-            return res.status(400).send({message: 'not added'})
+            return res.status(400).send({message: ""})
         }
     })
killedBy: GET /user POST /user add a invalid user wrong attribut
statusReason: expected { message: '' } to deeply equal { message: 'not added' }

[Timeout] BlockStatement
src/MVC/route/route.mjs:73:31
             return res.status(400).send({message: 'not added'})
         }
     })
-    .delete(async (req,res)=> {
-        // #swagger.summary = 'supprime tous les users'
-        // #swagger.description = 'supprime tous les users'
-        return res.status(200).send(await userController.remove())
-    })
+    .delete(async (req,res)=> {})
 router
     .route('/user/:login')

[Killed] StringLiteral
src/MVC/route/route.mjs:79:12
         return res.status(200).send(await userController.remove())
     })
 router
-    .route('/user/:login')
+    .route("")
     .get(async (req, res) =>{
         // #swagger.summary = 'renvoie un user selon son login'
statusReason: listen EADDRINUSE: address already in use :::8080

[Timeout] BlockStatement
src/MVC/route/route.mjs:80:29
     })
 router
     .route('/user/:login')
-    .get(async (req, res) =>{
-        // #swagger.summary = 'renvoie un user selon son login'
-        // #swagger.description = 'renvoie un user selon son login'
-        const login = decodeURIComponent(req.params.login)
-        const user = await userController.findByLogin(login)
-        if (user==null)
-            return res.status(404).send({message: "user not found"})
-        else
-            return res.status(200).send(user)
-    })
+    .get(async (req, res) =>{})
 
 router

[Killed] ConditionalExpression
src/MVC/route/route.mjs:85:13
         // #swagger.description = 'renvoie un user selon son login'
         const login = decodeURIComponent(req.params.login)
         const user = await userController.findByLogin(login)
-        if (user==null)
+        if (false)
             return res.status(404).send({message: "user not found"})
         else
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] EqualityOperator
src/MVC/route/route.mjs:85:13
         // #swagger.description = 'renvoie un user selon son login'
         const login = decodeURIComponent(req.params.login)
         const user = await userController.findByLogin(login)
-        if (user==null)
+        if (user != null)
             return res.status(404).send({message: "user not found"})
         else
statusReason: listen EADDRINUSE: address already in use :::8080

[Timeout] BlockStatement
src/MVC/route/route.mjs:93:31
 
 router
     .route('/user/login')
-    .post( async (req, res) =>{
-        // #swagger.summary = 'identification'
-        // #swagger.description = 'vérifie si les identifiants du user et le renvoie si ils sont valident'
-        try {
-            const user = await userController.verifLogin(req.body.login,req.body.password)
-            return res.status(200).send(user)
-        }catch (e) {
-            return res.status(404).send({message: "user not found"})
-        }
-    })
+    .post( async (req, res) =>{})
 router
     .route('/user/:login/:idToilette/:note')

[Killed] BlockStatement
src/MVC/route/route.mjs:96:13
     .post( async (req, res) =>{
         // #swagger.summary = 'identification'
         // #swagger.description = 'vérifie si les identifiants du user et le renvoie si ils sont valident'
-        try {
-            const user = await userController.verifLogin(req.body.login,req.body.password)
-            return res.status(200).send(user)
-        }catch (e) {
+        try {}catch (e) {
             return res.status(404).send({message: "user not found"})
         }
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BlockStatement
src/MVC/route/route.mjs:99:20
         try {
             const user = await userController.verifLogin(req.body.login,req.body.password)
             return res.status(200).send(user)
-        }catch (e) {
-            return res.status(404).send({message: "user not found"})
-        }
+        }catch (e) {}
     })
 router
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] StringLiteral
src/MVC/route/route.mjs:104:12
         }
     })
 router
-    .route('/user/:login/:idToilette/:note')
+    .route("")
     .get(async (req, res) =>{
         // #swagger.summary = 'ajoute un avis'
statusReason: listen EADDRINUSE: address already in use :::8080

[Timeout] BlockStatement
src/MVC/route/route.mjs:105:29
     })
 router
     .route('/user/:login/:idToilette/:note')
-    .get(async (req, res) =>{
-        // #swagger.summary = 'ajoute un avis'
-        // #swagger.description = 'ajoute un avis dans un user pour un idToilette et une note donnée'
-        const login = decodeURIComponent(req.params.login)
-        const idToilette = parseInt(decodeURIComponent(req.params.idToilette))
-        const note = decodeURIComponent(req.params.note)
-        try {
-            return res.status(200).send(await userController.addAvis(idToilette,login,note))
-        }catch (e) {
-            console.log(e)
-            return res.status(400).send({message: "review not added"})
-        }
-    })
+    .get(async (req, res) =>{})
 
 router

[Killed] BlockStatement
src/MVC/route/route.mjs:111:13
         const login = decodeURIComponent(req.params.login)
         const idToilette = parseInt(decodeURIComponent(req.params.idToilette))
         const note = decodeURIComponent(req.params.note)
-        try {
-            return res.status(200).send(await userController.addAvis(idToilette,login,note))
-        }catch (e) {
+        try {}catch (e) {
             console.log(e)
             return res.status(400).send({message: "review not added"})
statusReason: listen EADDRINUSE: address already in use :::8080

[NoCoverage] BlockStatement
src/MVC/route/route.mjs:113:20
         const note = decodeURIComponent(req.params.note)
         try {
             return res.status(200).send(await userController.addAvis(idToilette,login,note))
-        }catch (e) {
-            console.log(e)
-            return res.status(400).send({message: "review not added"})
-        }
+        }catch (e) {}
     })
 

[NoCoverage] StringLiteral
src/MVC/route/route.mjs:115:51
             return res.status(200).send(await userController.addAvis(idToilette,login,note))
         }catch (e) {
             console.log(e)
-            return res.status(400).send({message: "review not added"})
+            return res.status(400).send({message: ""})
         }
     })

[NoCoverage] BlockStatement
src/MVC/route/route.mjs:121:29
 
 router
     .route('/user/generate/FAKE')
-    .get(async (req, res) =>{
-        // #swagger.summary = 'génère des faux user'
-        // #swagger.description = 'fonction de test qui génère des faux user avec des faux avis'
-        res.status(200).send(await userController.fakeDonneesGenerate())})
+    .get(async (req, res) =>{})
 
 
