[Killed] BooleanLiteral
src/MVC/dao/ToiletteDAO.mjs:7:43
 
 //Schema d'un WC
 const wcSchema = new mongoose.Schema({
-    identifiant: {type: Number, required: true},
+    identifiant: {type: Number, required: false},
     nom: {type: String, required: true},
     latitude: {type: Number, required: true},
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ObjectLiteral
src/MVC/dao/ToiletteDAO.mjs:7:18
 
 //Schema d'un WC
 const wcSchema = new mongoose.Schema({
-    identifiant: {type: Number, required: true},
+    identifiant: {},
     nom: {type: String, required: true},
     latitude: {type: Number, required: true},
statusReason: listen EADDRINUSE: address already in use :::8080

[Survived] BooleanLiteral
src/MVC/dao/ToiletteDAO.mjs:8:35
 //Schema d'un WC
 const wcSchema = new mongoose.Schema({
     identifiant: {type: Number, required: true},
-    nom: {type: String, required: true},
+    nom: {type: String, required: false},
     latitude: {type: Number, required: true},
     longitude: {type: Number, required: true},

[Killed] ObjectLiteral
src/MVC/dao/ToiletteDAO.mjs:8:10
 //Schema d'un WC
 const wcSchema = new mongoose.Schema({
     identifiant: {type: Number, required: true},
-    nom: {type: String, required: true},
+    nom: {},
     latitude: {type: Number, required: true},
     longitude: {type: Number, required: true},
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BooleanLiteral
src/MVC/dao/ToiletteDAO.mjs:9:40
 const wcSchema = new mongoose.Schema({
     identifiant: {type: Number, required: true},
     nom: {type: String, required: true},
-    latitude: {type: Number, required: true},
+    latitude: {type: Number, required: false},
     longitude: {type: Number, required: true},
     ranking: {type: Number, required: true},
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BooleanLiteral
src/MVC/dao/ToiletteDAO.mjs:10:41
     identifiant: {type: Number, required: true},
     nom: {type: String, required: true},
     latitude: {type: Number, required: true},
-    longitude: {type: Number, required: true},
+    longitude: {type: Number, required: false},
     ranking: {type: Number, required: true},
     nbr_avis: {type: Number, required: true}
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ObjectLiteral
src/MVC/dao/ToiletteDAO.mjs:10:16
     identifiant: {type: Number, required: true},
     nom: {type: String, required: true},
     latitude: {type: Number, required: true},
-    longitude: {type: Number, required: true},
+    longitude: {},
     ranking: {type: Number, required: true},
     nbr_avis: {type: Number, required: true}
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BooleanLiteral
src/MVC/dao/ToiletteDAO.mjs:11:39
     nom: {type: String, required: true},
     latitude: {type: Number, required: true},
     longitude: {type: Number, required: true},
-    ranking: {type: Number, required: true},
+    ranking: {type: Number, required: false},
     nbr_avis: {type: Number, required: true}
 })
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BooleanLiteral
src/MVC/dao/ToiletteDAO.mjs:12:40
     latitude: {type: Number, required: true},
     longitude: {type: Number, required: true},
     ranking: {type: Number, required: true},
-    nbr_avis: {type: Number, required: true}
+    nbr_avis: {type: Number, required: false}
 })
 const MongoWC = new mongoose.model('toiletCollection', wcSchema)
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BlockStatement
src/MVC/dao/ToiletteDAO.mjs:19:26
 const toiletteDAO = {
 
     //Renvoie un tableau de toilette
-    findAll: async () => {
-        await toiletteDAO.deleteAll()
-        for (let i = 0; i < res.resWC.length; i++) {
-
-            let donneeWC = {
-                identifiant: parseInt(res.resWC[i].identifiant),
-                nom: res.resWC[i].nom,
-                latitude: parseFloat(res.resWC[i].latitude),
-                longitude: parseFloat(res.resWC[i].longitude)
-            }
-            let WC = new ToilettesModel(donneeWC)
-
-            await WC.calculMoyenne()
-            await toiletteDAO.addToilette(WC)
-        }
-
-        const data = await MongoWC.find({}, {_id: 0, __v: 0}).lean()
-        return data.map(toilet => new ToilettesModel(toilet))
-    },
+    findAll: async () => {},
     //Renvoie une toillete en fonction de son id
     findById: async (idWC) => {
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] EqualityOperator
src/MVC/dao/ToiletteDAO.mjs:21:25
     //Renvoie un tableau de toilette
     findAll: async () => {
         await toiletteDAO.deleteAll()
-        for (let i = 0; i < res.resWC.length; i++) {
+        for (let i = 0; i <= res.resWC.length; i++) {
 
             let donneeWC = {
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ConditionalExpression
src/MVC/dao/ToiletteDAO.mjs:21:25
     //Renvoie un tableau de toilette
     findAll: async () => {
         await toiletteDAO.deleteAll()
-        for (let i = 0; i < res.resWC.length; i++) {
+        for (let i = 0; false; i++) {
 
             let donneeWC = {
statusReason: listen EADDRINUSE: address already in use :::8080

[Survived] ObjectLiteral
src/MVC/dao/ToiletteDAO.mjs:23:28
         await toiletteDAO.deleteAll()
         for (let i = 0; i < res.resWC.length; i++) {
 
-            let donneeWC = {
-                identifiant: parseInt(res.resWC[i].identifiant),
-                nom: res.resWC[i].nom,
-                latitude: parseFloat(res.resWC[i].latitude),
-                longitude: parseFloat(res.resWC[i].longitude)
-            }
+            let donneeWC = {}
             let WC = new ToilettesModel(donneeWC)
 

[Survived] ObjectLiteral
src/MVC/dao/ToiletteDAO.mjs:35:45
             await toiletteDAO.addToilette(WC)
         }
 
-        const data = await MongoWC.find({}, {_id: 0, __v: 0}).lean()
+        const data = await MongoWC.find({}, {}).lean()
         return data.map(toilet => new ToilettesModel(toilet))
     },

[Killed] ArrowFunction
src/MVC/dao/ToiletteDAO.mjs:36:25
         }
 
         const data = await MongoWC.find({}, {_id: 0, __v: 0}).lean()
-        return data.map(toilet => new ToilettesModel(toilet))
+        return data.map(() => undefined)
     },
     //Renvoie une toillete en fonction de son id
killedBy: findAll() findall toilet
statusReason: expected false to deeply equal true

[Killed] BlockStatement
src/MVC/dao/ToiletteDAO.mjs:39:31
         return data.map(toilet => new ToilettesModel(toilet))
     },
     //Renvoie une toillete en fonction de son id
-    findById: async (idWC) => {
-        const myToilette = await MongoWC.findOne({identifiant: idWC}, {_id: 0}).lean()
-        console.log(myToilette)
-        return myToilette == null ? null : new ToilettesModel(myToilette)
-    },
+    findById: async (idWC) => {},
     //Supprime toutes les toiletes
     deleteAll: async () => {
killedBy: findbyID() WC introuvable
statusReason: expected undefined to deeply equal null

[Killed] ConditionalExpression
src/MVC/dao/ToiletteDAO.mjs:42:16
     findById: async (idWC) => {
         const myToilette = await MongoWC.findOne({identifiant: idWC}, {_id: 0}).lean()
         console.log(myToilette)
-        return myToilette == null ? null : new ToilettesModel(myToilette)
+        return true ? null : new ToilettesModel(myToilette)
     },
     //Supprime toutes les toiletes
killedBy: findbyID() WC trouvable
statusReason: expected null to deeply equal ToilettesModel{ identifiant: 2, …(5) }

[Killed] ConditionalExpression
src/MVC/dao/ToiletteDAO.mjs:42:16
     findById: async (idWC) => {
         const myToilette = await MongoWC.findOne({identifiant: idWC}, {_id: 0}).lean()
         console.log(myToilette)
-        return myToilette == null ? null : new ToilettesModel(myToilette)
+        return false ? null : new ToilettesModel(myToilette)
     },
     //Supprime toutes les toiletes
killedBy: findbyID() WC introuvable
statusReason: expected ToilettesModel{ …(6) } to deeply equal null

[Survived] BlockStatement
src/MVC/dao/ToiletteDAO.mjs:45:28
         return myToilette == null ? null : new ToilettesModel(myToilette)
     },
     //Supprime toutes les toiletes
-    deleteAll: async () => {
-        await MongoWC.deleteMany({})
-    },
+    deleteAll: async () => {},
     //Ajoute  une toilete
     addToilette: async (Toilette) => {

[Killed] BlockStatement
src/MVC/dao/ToiletteDAO.mjs:49:38
         await MongoWC.deleteMany({})
     },
     //Ajoute  une toilete
-    addToilette: async (Toilette) => {
-
-        await MongoWC.collection.insertOne({
-            identifiant: Toilette.identifiant,
-            nom: Toilette.nom,
-            latitude: Toilette.latitude,
-            longitude: Toilette.longitude,
-            ranking: Toilette.ranking,
-            nbr_avis: Toilette.nbr_avis
-        })
-    }
+    addToilette: async (Toilette) => {}
 
 
killedBy: findAll() findall toilet
statusReason: expected +0 to deeply equal 34

[Killed] ObjectLiteral
src/MVC/dao/ToiletteDAO.mjs:51:44
     //Ajoute  une toilete
     addToilette: async (Toilette) => {
 
-        await MongoWC.collection.insertOne({
-            identifiant: Toilette.identifiant,
-            nom: Toilette.nom,
-            latitude: Toilette.latitude,
-            longitude: Toilette.longitude,
-            ranking: Toilette.ranking,
-            nbr_avis: Toilette.nbr_avis
-        })
+        await MongoWC.collection.insertOne({})
     }
 
killedBy: findbyID() WC trouvable
statusReason: expected null to deeply equal ToilettesModel{ identifiant: 2, …(5) }
