[Killed] BooleanLiteral
src/MVC/dao/BikeDAO.mjs:7:43
 
 //Schema pour un vélo
 const bikeSchema = new mongoose.Schema({
-    identifiant: {type: Number, required: true},
+    identifiant: {type: Number, required: false},
     nom: {type: String, required: true},
     addresse: {type: String, required: true},
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BooleanLiteral
src/MVC/dao/BikeDAO.mjs:9:40
 const bikeSchema = new mongoose.Schema({
     identifiant: {type: Number, required: true},
     nom: {type: String, required: true},
-    addresse: {type: String, required: true},
+    addresse: {type: String, required: false},
     nombreDeVeloDisponibles: {type: Number, required: true},
     nombreDeBorneDisponible: {type: Number, required: true},
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BooleanLiteral
src/MVC/dao/BikeDAO.mjs:10:55
     identifiant: {type: Number, required: true},
     nom: {type: String, required: true},
     addresse: {type: String, required: true},
-    nombreDeVeloDisponibles: {type: Number, required: true},
+    nombreDeVeloDisponibles: {type: Number, required: false},
     nombreDeBorneDisponible: {type: Number, required: true},
     latitude:{type: Number, required: true},
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BooleanLiteral
src/MVC/dao/BikeDAO.mjs:11:55
     nom: {type: String, required: true},
     addresse: {type: String, required: true},
     nombreDeVeloDisponibles: {type: Number, required: true},
-    nombreDeBorneDisponible: {type: Number, required: true},
+    nombreDeBorneDisponible: {type: Number, required: false},
     latitude:{type: Number, required: true},
     longitude:{type: Number, required: true}
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ObjectLiteral
src/MVC/dao/BikeDAO.mjs:11:30
     nom: {type: String, required: true},
     addresse: {type: String, required: true},
     nombreDeVeloDisponibles: {type: Number, required: true},
-    nombreDeBorneDisponible: {type: Number, required: true},
+    nombreDeBorneDisponible: {},
     latitude:{type: Number, required: true},
     longitude:{type: Number, required: true}
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BooleanLiteral
src/MVC/dao/BikeDAO.mjs:12:39
     addresse: {type: String, required: true},
     nombreDeVeloDisponibles: {type: Number, required: true},
     nombreDeBorneDisponible: {type: Number, required: true},
-    latitude:{type: Number, required: true},
+    latitude:{type: Number, required: false},
     longitude:{type: Number, required: true}
 })
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BooleanLiteral
src/MVC/dao/BikeDAO.mjs:13:40
     nombreDeVeloDisponibles: {type: Number, required: true},
     nombreDeBorneDisponible: {type: Number, required: true},
     latitude:{type: Number, required: true},
-    longitude:{type: Number, required: true}
+    longitude:{type: Number, required: false}
 })
 const MongoBike = new mongoose.model('bikeCollection', bikeSchema)
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] StringLiteral
src/MVC/dao/BikeDAO.mjs:15:38
     latitude:{type: Number, required: true},
     longitude:{type: Number, required: true}
 })
-const MongoBike = new mongoose.model('bikeCollection', bikeSchema)
+const MongoBike = new mongoose.model("", bikeSchema)
 
 const bikeDAO = {
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BlockStatement
src/MVC/dao/BikeDAO.mjs:20:26
 const bikeDAO = {
 
     //Renvoie un tableau de vélo
-    findAll: async () => {
-        await bikeDAO.deleteAll()
-        await MongoBike.insertMany(res.resVelo)
-        const data = await MongoBike.find({},{_id:0,__v:0}).lean()
-        return data.map(bike=>new BikeModel(bike))
-    },
+    findAll: async () => {},
     //Supprime tous les vélos
     deleteAll:  async()=>{
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ArrowFunction
src/MVC/dao/BikeDAO.mjs:24:25
         await bikeDAO.deleteAll()
         await MongoBike.insertMany(res.resVelo)
         const data = await MongoBike.find({},{_id:0,__v:0}).lean()
-        return data.map(bike=>new BikeModel(bike))
+        return data.map(() => undefined)
     },
     //Supprime tous les vélos
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] BlockStatement
src/MVC/dao/BikeDAO.mjs:27:26
         return data.map(bike=>new BikeModel(bike))
     },
     //Supprime tous les vélos
-    deleteAll:  async()=>{
-        await MongoBike.deleteMany({})
-    }
+    deleteAll:  async()=>{}
 
 
statusReason: listen EADDRINUSE: address already in use :::8080
