[Survived] ArrowFunction
src/MVC/controller/userController.mjs:5:14
 import userDAO from '../dao/userDAO.mjs'
 
 const userController = {
-    findAll: async () => await userDAO.findAll(),
+    findAll: () => undefined,
     findByLogin : async (login)=> {
         const user = await userDAO.findByLogin(login)

[Killed] BlockStatement
src/MVC/controller/userController.mjs:6:35
 
 const userController = {
     findAll: async () => await userDAO.findAll(),
-    findByLogin : async (login)=> {
-        const user = await userDAO.findByLogin(login)
-        return user
-    },
+    findByLogin : async (login)=> {},
     add : async (user) => await userDAO.add(user),
     addAvis: async (idToilette,login,note) => await userDAO.addAvis(idToilette,login,note),
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ArrowFunction
src/MVC/controller/userController.mjs:10:11
         const user = await userDAO.findByLogin(login)
         return user
     },
-    add : async (user) => await userDAO.add(user),
+    add : () => undefined,
     addAvis: async (idToilette,login,note) => await userDAO.addAvis(idToilette,login,note),
     verifLogin: async (login,password) => await userDAO.verifLogin(login,password),
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ArrowFunction
src/MVC/controller/userController.mjs:11:14
         return user
     },
     add : async (user) => await userDAO.add(user),
-    addAvis: async (idToilette,login,note) => await userDAO.addAvis(idToilette,login,note),
+    addAvis: () => undefined,
     verifLogin: async (login,password) => await userDAO.verifLogin(login,password),
     //METHODE TEST
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ArrowFunction
src/MVC/controller/userController.mjs:12:17
     },
     add : async (user) => await userDAO.add(user),
     addAvis: async (idToilette,login,note) => await userDAO.addAvis(idToilette,login,note),
-    verifLogin: async (login,password) => await userDAO.verifLogin(login,password),
+    verifLogin: () => undefined,
     //METHODE TEST
     fakeDonneesGenerate: async()=> await userDAO.fakeDonneesGenerate(),
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ArrowFunction
src/MVC/controller/userController.mjs:14:26
     addAvis: async (idToilette,login,note) => await userDAO.addAvis(idToilette,login,note),
     verifLogin: async (login,password) => await userDAO.verifLogin(login,password),
     //METHODE TEST
-    fakeDonneesGenerate: async()=> await userDAO.fakeDonneesGenerate(),
+    fakeDonneesGenerate: () => undefined,
     remove: async() => await userDAO.deleteAll()
 }
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ArrowFunction
src/MVC/controller/userController.mjs:15:13
     verifLogin: async (login,password) => await userDAO.verifLogin(login,password),
     //METHODE TEST
     fakeDonneesGenerate: async()=> await userDAO.fakeDonneesGenerate(),
-    remove: async() => await userDAO.deleteAll()
+    remove: () => undefined
 }
 export default userController
statusReason: listen EADDRINUSE: address already in use :::8080
