[Killed] BlockStatement
src/MVC/model/AvisModel.mjs:4:22
 export default class Avis {
     idToilette
     ranking
-    constructor(obj) {
-//declare et instancie les attribut en recopiant ceux de obj
-        Object.assign(this, obj)
-    }
+    constructor(obj) {}
 
 }
killedBy: Test du model Avis create
statusReason: expected Avis{ idToilette: undefined, …(1) } to have property 'idToilette' of 1, but got undefined
