[Survived] UnaryOperator
src/MVC/model/ToilettesModel.mjs:8:13
     nom
     latitude
     longitude
-    ranking=-1
+    ranking=+1
     nbr_avis=0
 

[Killed] BlockStatement
src/MVC/model/ToilettesModel.mjs:11:22
     ranking=-1
     nbr_avis=0
 
-    constructor(obj) {
-        Object.assign(this, obj)
-    }
+    constructor(obj) {}
     async calculMoyenne(){
         let datauser = await userDAO.findAll()
killedBy: CalculMoyenne() one user w/ one review [match]
statusReason: expected -1 to deeply equal 3

[Killed] BlockStatement
src/MVC/model/ToilettesModel.mjs:14:26
     constructor(obj) {
         Object.assign(this, obj)
     }
-    async calculMoyenne(){
-        let datauser = await userDAO.findAll()
-        let occurence = 0
-        let totalnote = 0
-
-
-        for (let i = 0; i < datauser.length; i++) {
-            for (let j = 0; j < datauser[i].avisdonnees.length; j++) {
-
-                if (datauser[i].avisdonnees[j].idToilette == this.identifiant) {
-
-                    totalnote += datauser[i].avisdonnees[j].ranking
-                    occurence++
-                }
-
-            }
-        }
-
-        this.ranking=totalnote==0?-1:totalnote/occurence
-        this.nbr_avis=occurence
-    }
+    async calculMoyenne(){}
 
 
killedBy: CalculMoyenne() one user w/ one review [match]
statusReason: expected -1 to deeply equal 3

[Killed] BlockStatement
src/MVC/model/ToilettesModel.mjs:20:51
         let totalnote = 0
 
 
-        for (let i = 0; i < datauser.length; i++) {
-            for (let j = 0; j < datauser[i].avisdonnees.length; j++) {
-
-                if (datauser[i].avisdonnees[j].idToilette == this.identifiant) {
-
-                    totalnote += datauser[i].avisdonnees[j].ranking
-                    occurence++
-                }
-
-            }
-        }
+        for (let i = 0; i < datauser.length; i++) {}
 
         this.ranking=totalnote==0?-1:totalnote/occurence
killedBy: CalculMoyenne() one user w/ one review [match]
statusReason: expected -1 to deeply equal 3

[Killed] EqualityOperator
src/MVC/model/ToilettesModel.mjs:20:25
         let totalnote = 0
 
 
-        for (let i = 0; i < datauser.length; i++) {
+        for (let i = 0; i <= datauser.length; i++) {
             for (let j = 0; j < datauser[i].avisdonnees.length; j++) {
 
killedBy: CalculMoyenne() no user
statusReason: Cannot read properties of undefined (reading 'avisdonnees')

[Killed] UpdateOperator
src/MVC/model/ToilettesModel.mjs:21:65
 
 
         for (let i = 0; i < datauser.length; i++) {
-            for (let j = 0; j < datauser[i].avisdonnees.length; j++) {
+            for (let j = 0; j < datauser[i].avisdonnees.length; j--) {
 
                 if (datauser[i].avisdonnees[j].idToilette == this.identifiant) {
killedBy: CalculMoyenne() one user w/out review
statusReason: Cannot read properties of undefined (reading 'idToilette')

[Killed] EqualityOperator
src/MVC/model/ToilettesModel.mjs:21:29
 
 
         for (let i = 0; i < datauser.length; i++) {
-            for (let j = 0; j < datauser[i].avisdonnees.length; j++) {
+            for (let j = 0; j <= datauser[i].avisdonnees.length; j++) {
 
                 if (datauser[i].avisdonnees[j].idToilette == this.identifiant) {
killedBy: CalculMoyenne() one user w/out review
statusReason: Cannot read properties of undefined (reading 'idToilette')

[Killed] EqualityOperator
src/MVC/model/ToilettesModel.mjs:23:21
         for (let i = 0; i < datauser.length; i++) {
             for (let j = 0; j < datauser[i].avisdonnees.length; j++) {
 
-                if (datauser[i].avisdonnees[j].idToilette == this.identifiant) {
+                if (datauser[i].avisdonnees[j].idToilette != this.identifiant) {
 
                     totalnote += datauser[i].avisdonnees[j].ranking
killedBy: CalculMoyenne() one user w/out review
statusReason: expected 3 to deeply equal -1

[Killed] ConditionalExpression
src/MVC/model/ToilettesModel.mjs:23:21
         for (let i = 0; i < datauser.length; i++) {
             for (let j = 0; j < datauser[i].avisdonnees.length; j++) {
 
-                if (datauser[i].avisdonnees[j].idToilette == this.identifiant) {
+                if (true) {
 
                     totalnote += datauser[i].avisdonnees[j].ranking
killedBy: CalculMoyenne() one user w/out review
statusReason: expected 3 to deeply equal -1

[Killed] AssignmentOperator
src/MVC/model/ToilettesModel.mjs:25:21
 
                 if (datauser[i].avisdonnees[j].idToilette == this.identifiant) {
 
-                    totalnote += datauser[i].avisdonnees[j].ranking
+                    totalnote -= datauser[i].avisdonnees[j].ranking
                     occurence++
                 }
killedBy: CalculMoyenne() one user w/ one review [match]
statusReason: expected -3 to deeply equal 3

[Killed] UpdateOperator
src/MVC/model/ToilettesModel.mjs:26:21
                 if (datauser[i].avisdonnees[j].idToilette == this.identifiant) {
 
                     totalnote += datauser[i].avisdonnees[j].ranking
-                    occurence++
+                    occurence--
                 }
 
killedBy: CalculMoyenne() one user w/ one review [match]
statusReason: expected -3 to deeply equal 3

[Killed] ConditionalExpression
src/MVC/model/ToilettesModel.mjs:32:22
             }
         }
 
-        this.ranking=totalnote==0?-1:totalnote/occurence
+        this.ranking=true?-1:totalnote/occurence
         this.nbr_avis=occurence
     }
killedBy: CalculMoyenne() one user w/ one review [match]
statusReason: expected -1 to deeply equal 3

[Killed] ConditionalExpression
src/MVC/model/ToilettesModel.mjs:32:22
             }
         }
 
-        this.ranking=totalnote==0?-1:totalnote/occurence
+        this.ranking=false?-1:totalnote/occurence
         this.nbr_avis=occurence
     }
killedBy: CalculMoyenne() no user
statusReason: expected NaN to deeply equal -1
