[Killed] BlockStatement
src/MVC/model/BikeModel.mjs:10:22
     latitude
     longitude
 
-    constructor(obj) {
-//declare et instancie les attribut en recopiant ceux de obj
-        Object.assign(this, obj)
-    }
+    constructor(obj) {}
 
 }
killedBy: Test du model Bike create
statusReason: expected BikeModel{ …(7) } to have property 'identifiant' of 1001, but got undefined
