[Killed] BlockStatement
src/MVC/model/userModel.mjs:5:22
     login
     password
     avisdonnees
-    constructor(obj) {
-        this.login = obj.login
-        this.password = obj.password
-        this.avisdonnees=obj.avisdonnees
-    }
+    constructor(obj) {}
 }
 
killedBy: CalculMoyenne() one user w/out review
statusReason: the string "Not a valid user" was thrown, throw an Error :)
