[Killed] ObjectLiteral
src/MVC/controller/ToiletteController.mjs:4:28
 "use strict"
 import toiletteDAO from "../dao/ToiletteDAO.mjs";
 
-const toiletteController = {
-    findAll: async () => await toiletteDAO.findAll(),
-    findById:async (idToilette) => await toiletteDAO.findById(idToilette),
-    add: async (toilet) => await toiletteDAO.addToilette(toilet)
-}
+const toiletteController = {}
 export default toiletteController
 
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ArrowFunction
src/MVC/controller/ToiletteController.mjs:5:14
 import toiletteDAO from "../dao/ToiletteDAO.mjs";
 
 const toiletteController = {
-    findAll: async () => await toiletteDAO.findAll(),
+    findAll: () => undefined,
     findById:async (idToilette) => await toiletteDAO.findById(idToilette),
     add: async (toilet) => await toiletteDAO.addToilette(toilet)
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ArrowFunction
src/MVC/controller/ToiletteController.mjs:6:14
 
 const toiletteController = {
     findAll: async () => await toiletteDAO.findAll(),
-    findById:async (idToilette) => await toiletteDAO.findById(idToilette),
+    findById:() => undefined,
     add: async (toilet) => await toiletteDAO.addToilette(toilet)
 }
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ArrowFunction
src/MVC/controller/ToiletteController.mjs:7:10
 const toiletteController = {
     findAll: async () => await toiletteDAO.findAll(),
     findById:async (idToilette) => await toiletteDAO.findById(idToilette),
-    add: async (toilet) => await toiletteDAO.addToilette(toilet)
+    add: () => undefined
 }
 export default toiletteController
statusReason: listen EADDRINUSE: address already in use :::8080
