[Killed] BooleanLiteral
src/MVC/dao/AvisDAO.mjs:5:42
 
 //Schema pour créer un avis
 export const avisSchema = new mongoose.Schema({
-    idToilette: {type: Number, required: true},
+    idToilette: {type: Number, required: false},
     ranking: {type: Number, required: true},
 })
statusReason: listen EADDRINUSE: address already in use :::8080

[Killed] ObjectLiteral
src/MVC/dao/AvisDAO.mjs:5:17
 
 //Schema pour créer un avis
 export const avisSchema = new mongoose.Schema({
-    idToilette: {type: Number, required: true},
+    idToilette: {},
     ranking: {type: Number, required: true},
 })
statusReason: listen EADDRINUSE: address already in use :::8080

[Survived] BooleanLiteral
src/MVC/dao/AvisDAO.mjs:6:39
 //Schema pour créer un avis
 export const avisSchema = new mongoose.Schema({
     idToilette: {type: Number, required: true},
-    ranking: {type: Number, required: true},
+    ranking: {type: Number, required: false},
 })
 
