[NoCoverage] UnaryOperator
src/App.js:33:26
 
 //Une latitude et une longitude par défault dans la ville de Nantes
 const defaultLatitude = 47.14;
-const defaultLongitude = -1.55;
+const defaultLongitude = +1.55;
 
 

[NoCoverage] BlockStatement
src/App.js:42:62
  * @param {string} customTitle - Le titre personnalisé à afficher dans l'alerte.
  * @param {string} [icon='info'] - L'icône à afficher dans l'alerte (par défaut, 'info').
  */
-export function showCustomAlert(customText,customTitle,icon) {
-    Swal.fire({
-        title: customTitle ,
-        text: customText,
-        icon: 'info',
-        confirmButtonText: 'OK',
-        customClass: {
-            popup: 'custom-popup',
-        },
-    });
-}
+export function showCustomAlert(customText,customTitle,icon) {}
 
 

[NoCoverage] StringLiteral
src/App.js:46:15
     Swal.fire({
         title: customTitle ,
         text: customText,
-        icon: 'info',
+        icon: "",
         confirmButtonText: 'OK',
         customClass: {

[NoCoverage] ArrayDeclaration
src/App.js:65:30
     const [routingControl2, setRoutingControl2] = useState(null);
 
     // État pour les waypoints (points de passage) utilisés dans le routing.
-    let waypoints = useState([]);
+    let waypoints = useState(["Stryker was here"]);
 
     // Gestionnaire de clic sur un marqueur de toilette.

[NoCoverage] BlockStatement
src/App.js:68:49
     let waypoints = useState([]);
 
     // Gestionnaire de clic sur un marqueur de toilette.
-    const handleToiletMarkerClick = (toilet) => {
-        if (routingControl) {
-            // Supprimer le contrôle de routing existant.
-            mapRef.current.removeControl(routingControl);
-            // Initialiser le routing vers la toilette sélectionnée.
-            initRouting(userLocation, [toilet.latitude, toilet.longitude]);
-        }
-    };
+    const handleToiletMarkerClick = (toilet) => {};
 
     // Gestionnaire de clic sur un marqueur de vélo.

[NoCoverage] ConditionalExpression
src/App.js:69:13
 
     // Gestionnaire de clic sur un marqueur de toilette.
     const handleToiletMarkerClick = (toilet) => {
-        if (routingControl) {
+        if (false) {
             // Supprimer le contrôle de routing existant.
             mapRef.current.removeControl(routingControl);

[NoCoverage] ConditionalExpression
src/App.js:69:13
 
     // Gestionnaire de clic sur un marqueur de toilette.
     const handleToiletMarkerClick = (toilet) => {
-        if (routingControl) {
+        if (true) {
             // Supprimer le contrôle de routing existant.
             mapRef.current.removeControl(routingControl);

[NoCoverage] BlockStatement
src/App.js:78:45
     };
 
     // Gestionnaire de clic sur un marqueur de vélo.
-    const handleBikeMarkerClick = (bike) => {
-        if (routingControl2) {
-            // Supprimer le contrôle de routing existant.
-            mapRef.current.removeControl(routingControl2);
-            // Initialiser le routing vers le vélo sélectionné.
-            initRouting2(userLocation, [bike.latitude, bike.longitude]);
-        }
-    };
+    const handleBikeMarkerClick = (bike) => {};
 
     // État pour le terme de recherche.

[NoCoverage] BlockStatement
src/App.js:79:30
 
     // Gestionnaire de clic sur un marqueur de vélo.
     const handleBikeMarkerClick = (bike) => {
-        if (routingControl2) {
-            // Supprimer le contrôle de routing existant.
-            mapRef.current.removeControl(routingControl2);
-            // Initialiser le routing vers le vélo sélectionné.
-            initRouting2(userLocation, [bike.latitude, bike.longitude]);
-        }
+        if (routingControl2) {}
     };
 

[NoCoverage] ConditionalExpression
src/App.js:79:13
 
     // Gestionnaire de clic sur un marqueur de vélo.
     const handleBikeMarkerClick = (bike) => {
-        if (routingControl2) {
+        if (false) {
             // Supprimer le contrôle de routing existant.
             mapRef.current.removeControl(routingControl2);

[NoCoverage] StringLiteral
src/App.js:88:50
     };
 
     // État pour le terme de recherche.
-    const [searchTerm, setSearchTerm] = useState("");
+    const [searchTerm, setSearchTerm] = useState("Stryker was here!");
 
     // État pour l'emplacement de recherche.

[NoCoverage] BooleanLiteral
src/App.js:94:60
     const [searchLocation, setSearchLocation] = useState(null);
 
     // État pour indiquer si la recherche a été soumise.
-    const [searchSubmitted, setSearchSubmitted] = useState(false);
+    const [searchSubmitted, setSearchSubmitted] = useState(true);
 
     // État pour filtrer les vélos.

[NoCoverage] BooleanLiteral
src/App.js:97:51
     const [searchSubmitted, setSearchSubmitted] = useState(false);
 
     // État pour filtrer les vélos.
-    const [filterBike, setBikeChecked] = useState(true);
+    const [filterBike, setBikeChecked] = useState(false);
 
     // État pour filtrer les toilettes.

[NoCoverage] BooleanLiteral
src/App.js:100:55
     const [filterBike, setBikeChecked] = useState(true);
 
     // État pour filtrer les toilettes.
-    const [filterToilet, setToiletChecked] = useState(true);
+    const [filterToilet, setToiletChecked] = useState(false);
 
     // État pour la liste des vélos.

[NoCoverage] ArrayDeclaration
src/App.js:106:44
     const [bikes, setBikes] = useState([]);
 
     // État pour la liste des toilettes.
-    const [toilets, setToilets] = useState([]);
+    const [toilets, setToilets] = useState(["Stryker was here"]);
 
     // État pour la position de l'utilisateur.

[NoCoverage] BooleanLiteral
src/App.js:115:40
     const mapRef = useRef();
 
     // État pour le composant de connexion.
-    const [state, setState] = useState(false);
+    const [state, setState] = useState(true);
 
     // État pour l'utilisateur connecté.

[NoCoverage] BlockStatement
src/App.js:124:43
     const [newAvis, setNewAvis] = useState("KO");
 
     // Gestionnaire de changement de terme de recherche.
-    const handleSearchChange = (event) => {
-        setSearchTerm(event.target.value);
-    };
+    const handleSearchChange = (event) => {};
 
     // Gestionnaire de soumission de recherche.

[NoCoverage] BlockStatement
src/App.js:129:38
     };
 
     // Gestionnaire de soumission de recherche.
-    const handleSearchSubmit = () => {
-        setSearchSubmitted(true);
-        setSearchLocation(searchTerm);
-    };
+    const handleSearchSubmit = () => {};
 
     // Composant pour gérer la recherche sur la carte.

[NoCoverage] BooleanLiteral
src/App.js:130:28
 
     // Gestionnaire de soumission de recherche.
     const handleSearchSubmit = () => {
-        setSearchSubmitted(true);
+        setSearchSubmitted(false);
         setSearchLocation(searchTerm);
     };

[NoCoverage] ConditionalExpression
src/App.js:139:17
         const map = useMap();
 
         useEffect(() => {
-            if (searchLocation) {
+            if (false) {
                 // Effectuer une recherche de géocodage grâce à l'API Open Street Map.
                 const url = `https://nominatim.openstreetmap.org/search?format=json&q=${searchLocation}`;

[NoCoverage] ConditionalExpression
src/App.js:139:17
         const map = useMap();
 
         useEffect(() => {
-            if (searchLocation) {
+            if (true) {
                 // Effectuer une recherche de géocodage grâce à l'API Open Street Map.
                 const url = `https://nominatim.openstreetmap.org/search?format=json&q=${searchLocation}`;

[NoCoverage] ArrowFunction
src/App.js:143:27
                 // Effectuer une recherche de géocodage grâce à l'API Open Street Map.
                 const url = `https://nominatim.openstreetmap.org/search?format=json&q=${searchLocation}`;
                 fetch(url)
-                    .then(response => response.json())
+                    .then(() => undefined)
                     .then(data => {
                         if (data && data.length > 0) {

[NoCoverage] BlockStatement
src/App.js:144:35
                 const url = `https://nominatim.openstreetmap.org/search?format=json&q=${searchLocation}`;
                 fetch(url)
                     .then(response => response.json())
-                    .then(data => {
-                        if (data && data.length > 0) {
-                            const { lat, lon } = data[0];
-                            if (parseFloat(lat) > 47.17 && parseFloat(lat) < 47.26 && parseFloat(lon) > -1.68 && parseFloat(lon) < -1.49) {
-                                setSearchSubmitted(false);
-                                // Centrer la carte sur le résultat de la recherche.
-                                map.setView([parseFloat(lat), parseFloat(lon)], 16);
-                            } else {
-                                setSearchSubmitted(false);
-                                showCustomAlert("La localisation que vous recherchez n'est pas dans la ville de Nantes ou elle est mal écrite.", "Localisation Alert");
-                            }
-                        } else {
-                            showCustomAlert("La localisation que vous recherchez n'est pas dans la ville de Nantes ou elle est mal écrite.", "Localisation Alert");
-                        }
-                    })
+                    .then(data => {})
                     .catch(error => {
                         console.error("Error fetching location data:", error);

[NoCoverage] ConditionalExpression
src/App.js:145:29
                 fetch(url)
                     .then(response => response.json())
                     .then(data => {
-                        if (data && data.length > 0) {
+                        if (false) {
                             const { lat, lon } = data[0];
                             if (parseFloat(lat) > 47.17 && parseFloat(lat) < 47.26 && parseFloat(lon) > -1.68 && parseFloat(lon) < -1.49) {

[NoCoverage] LogicalOperator
src/App.js:145:29
                 fetch(url)
                     .then(response => response.json())
                     .then(data => {
-                        if (data && data.length > 0) {
+                        if (data || data.length > 0) {
                             const { lat, lon } = data[0];
                             if (parseFloat(lat) > 47.17 && parseFloat(lat) < 47.26 && parseFloat(lon) > -1.68 && parseFloat(lon) < -1.49) {

[NoCoverage] ConditionalExpression
src/App.js:147:114
                     .then(data => {
                         if (data && data.length > 0) {
                             const { lat, lon } = data[0];
-                            if (parseFloat(lat) > 47.17 && parseFloat(lat) < 47.26 && parseFloat(lon) > -1.68 && parseFloat(lon) < -1.49) {
+                            if (parseFloat(lat) > 47.17 && parseFloat(lat) < 47.26 && parseFloat(lon) > -1.68 && true) {
                                 setSearchSubmitted(false);
                                 // Centrer la carte sur le résultat de la recherche.

[NoCoverage] EqualityOperator
src/App.js:147:87
                     .then(data => {
                         if (data && data.length > 0) {
                             const { lat, lon } = data[0];
-                            if (parseFloat(lat) > 47.17 && parseFloat(lat) < 47.26 && parseFloat(lon) > -1.68 && parseFloat(lon) < -1.49) {
+                            if (parseFloat(lat) > 47.17 && parseFloat(lat) < 47.26 && parseFloat(lon) <= -1.68 && parseFloat(lon) < -1.49) {
                                 setSearchSubmitted(false);
                                 // Centrer la carte sur le résultat de la recherche.

[NoCoverage] BooleanLiteral
src/App.js:148:52
                         if (data && data.length > 0) {
                             const { lat, lon } = data[0];
                             if (parseFloat(lat) > 47.17 && parseFloat(lat) < 47.26 && parseFloat(lon) > -1.68 && parseFloat(lon) < -1.49) {
-                                setSearchSubmitted(false);
+                                setSearchSubmitted(true);
                                 // Centrer la carte sur le résultat de la recherche.
                                 map.setView([parseFloat(lat), parseFloat(lon)], 16);

[NoCoverage] BlockStatement
src/App.js:151:36
                                 setSearchSubmitted(false);
                                 // Centrer la carte sur le résultat de la recherche.
                                 map.setView([parseFloat(lat), parseFloat(lon)], 16);
-                            } else {
-                                setSearchSubmitted(false);
-                                showCustomAlert("La localisation que vous recherchez n'est pas dans la ville de Nantes ou elle est mal écrite.", "Localisation Alert");
-                            }
+                            } else {}
                         } else {
                             showCustomAlert("La localisation que vous recherchez n'est pas dans la ville de Nantes ou elle est mal écrite.", "Localisation Alert");

[NoCoverage] BooleanLiteral
src/App.js:152:52
                                 // Centrer la carte sur le résultat de la recherche.
                                 map.setView([parseFloat(lat), parseFloat(lon)], 16);
                             } else {
-                                setSearchSubmitted(false);
+                                setSearchSubmitted(true);
                                 showCustomAlert("La localisation que vous recherchez n'est pas dans la ville de Nantes ou elle est mal écrite.", "Localisation Alert");
                             }

[NoCoverage] StringLiteral
src/App.js:153:49
                                 map.setView([parseFloat(lat), parseFloat(lon)], 16);
                             } else {
                                 setSearchSubmitted(false);
-                                showCustomAlert("La localisation que vous recherchez n'est pas dans la ville de Nantes ou elle est mal écrite.", "Localisation Alert");
+                                showCustomAlert("", "Localisation Alert");
                             }
                         } else {

[NoCoverage] StringLiteral
src/App.js:153:146
                                 map.setView([parseFloat(lat), parseFloat(lon)], 16);
                             } else {
                                 setSearchSubmitted(false);
-                                showCustomAlert("La localisation que vous recherchez n'est pas dans la ville de Nantes ou elle est mal écrite.", "Localisation Alert");
+                                showCustomAlert("La localisation que vous recherchez n'est pas dans la ville de Nantes ou elle est mal écrite.", "");
                             }
                         } else {

[NoCoverage] BlockStatement
src/App.js:155:32
                                 setSearchSubmitted(false);
                                 showCustomAlert("La localisation que vous recherchez n'est pas dans la ville de Nantes ou elle est mal écrite.", "Localisation Alert");
                             }
-                        } else {
-                            showCustomAlert("La localisation que vous recherchez n'est pas dans la ville de Nantes ou elle est mal écrite.", "Localisation Alert");
-                        }
+                        } else {}
                     })
                     .catch(error => {

[NoCoverage] BlockStatement
src/App.js:159:37
                             showCustomAlert("La localisation que vous recherchez n'est pas dans la ville de Nantes ou elle est mal écrite.", "Localisation Alert");
                         }
                     })
-                    .catch(error => {
-                        console.error("Error fetching location data:", error);
-                    });
+                    .catch(error => {});
             }
         }, [searchLocation, map]);

[NoCoverage] ArrayDeclaration
src/App.js:163:12
                         console.error("Error fetching location data:", error);
                     });
             }
-        }, [searchLocation, map]);
+        }, []);
 
         return null;

[NoCoverage] BlockStatement
src/App.js:169:42
     };
 
     // Gestionnaire de clic sur le bouton de connexion.
-    const handleLoginButtonClick = () => {
-        setState(!state);
-    };
+    const handleLoginButtonClick = () => {};
 
     // Gestionnaire de changement de filtre pour les vélos.

[NoCoverage] BooleanLiteral
src/App.js:170:18
 
     // Gestionnaire de clic sur le bouton de connexion.
     const handleLoginButtonClick = () => {
-        setState(!state);
+        setState(state);
     };
 

[NoCoverage] BlockStatement
src/App.js:174:42
     };
 
     // Gestionnaire de changement de filtre pour les vélos.
-    const handleBikeFilterChange = () => {
-        // Contrôler l'affichage des itinéraires si un contrôle de routing existe.
-        if (routingControl2 != null) {
-            let routing = routingControl2;
-            if (filterBike) {
-                mapRef.current.removeControl(routingControl2);
-            } else {
-                routing.addTo(mapRef.current);
-                setRoutingControl2(routing);
-            }
-        }
-        // Inverser l'état du filtre.
-        setBikeChecked(!filterBike);
-    };
+    const handleBikeFilterChange = () => {};
 
     // Gestionnaire de changement de filtre pour les toilettes.

[NoCoverage] BlockStatement
src/App.js:176:38
     // Gestionnaire de changement de filtre pour les vélos.
     const handleBikeFilterChange = () => {
         // Contrôler l'affichage des itinéraires si un contrôle de routing existe.
-        if (routingControl2 != null) {
-            let routing = routingControl2;
-            if (filterBike) {
-                mapRef.current.removeControl(routingControl2);
-            } else {
-                routing.addTo(mapRef.current);
-                setRoutingControl2(routing);
-            }
-        }
+        if (routingControl2 != null) {}
         // Inverser l'état du filtre.
         setBikeChecked(!filterBike);

[NoCoverage] ConditionalExpression
src/App.js:176:13
     // Gestionnaire de changement de filtre pour les vélos.
     const handleBikeFilterChange = () => {
         // Contrôler l'affichage des itinéraires si un contrôle de routing existe.
-        if (routingControl2 != null) {
+        if (true) {
             let routing = routingControl2;
             if (filterBike) {

[NoCoverage] ConditionalExpression
src/App.js:178:17
         // Contrôler l'affichage des itinéraires si un contrôle de routing existe.
         if (routingControl2 != null) {
             let routing = routingControl2;
-            if (filterBike) {
+            if (true) {
                 mapRef.current.removeControl(routingControl2);
             } else {

[NoCoverage] BlockStatement
src/App.js:178:29
         // Contrôler l'affichage des itinéraires si un contrôle de routing existe.
         if (routingControl2 != null) {
             let routing = routingControl2;
-            if (filterBike) {
-                mapRef.current.removeControl(routingControl2);
-            } else {
+            if (filterBike) {} else {
                 routing.addTo(mapRef.current);
                 setRoutingControl2(routing);

[NoCoverage] BlockStatement
src/App.js:180:20
             let routing = routingControl2;
             if (filterBike) {
                 mapRef.current.removeControl(routingControl2);
-            } else {
-                routing.addTo(mapRef.current);
-                setRoutingControl2(routing);
-            }
+            } else {}
         }
         // Inverser l'état du filtre.

[NoCoverage] BooleanLiteral
src/App.js:186:24
             }
         }
         // Inverser l'état du filtre.
-        setBikeChecked(!filterBike);
+        setBikeChecked(filterBike);
     };
 

[NoCoverage] BlockStatement
src/App.js:190:44
     };
 
     // Gestionnaire de changement de filtre pour les toilettes.
-    const handleToiletFilterChange = () => {
-        // Contrôler l'affichage des itinéraires si un contrôle de routing existe.
-        if (routingControl != null) {
-            let routing = routingControl;
-            if (filterToilet) {
-                mapRef.current.removeControl(routingControl);
-            } else {
-                routing.addTo(mapRef.current);
-                setRoutingControl(routing);
-            }
-        }
-        // Inverser l'état du filtre.
-        setToiletChecked(!filterToilet);
-    };
+    const handleToiletFilterChange = () => {};
 
     // Gestionnaire de connexion.

[NoCoverage] ConditionalExpression
src/App.js:192:13
     // Gestionnaire de changement de filtre pour les toilettes.
     const handleToiletFilterChange = () => {
         // Contrôler l'affichage des itinéraires si un contrôle de routing existe.
-        if (routingControl != null) {
+        if (false) {
             let routing = routingControl;
             if (filterToilet) {

[NoCoverage] BlockStatement
src/App.js:192:37
     // Gestionnaire de changement de filtre pour les toilettes.
     const handleToiletFilterChange = () => {
         // Contrôler l'affichage des itinéraires si un contrôle de routing existe.
-        if (routingControl != null) {
-            let routing = routingControl;
-            if (filterToilet) {
-                mapRef.current.removeControl(routingControl);
-            } else {
-                routing.addTo(mapRef.current);
-                setRoutingControl(routing);
-            }
-        }
+        if (routingControl != null) {}
         // Inverser l'état du filtre.
         setToiletChecked(!filterToilet);

[NoCoverage] ConditionalExpression
src/App.js:194:17
         // Contrôler l'affichage des itinéraires si un contrôle de routing existe.
         if (routingControl != null) {
             let routing = routingControl;
-            if (filterToilet) {
+            if (true) {
                 mapRef.current.removeControl(routingControl);
             } else {

[NoCoverage] ConditionalExpression
src/App.js:194:17
         // Contrôler l'affichage des itinéraires si un contrôle de routing existe.
         if (routingControl != null) {
             let routing = routingControl;
-            if (filterToilet) {
+            if (false) {
                 mapRef.current.removeControl(routingControl);
             } else {

[NoCoverage] BlockStatement
src/App.js:196:20
             let routing = routingControl;
             if (filterToilet) {
                 mapRef.current.removeControl(routingControl);
-            } else {
-                routing.addTo(mapRef.current);
-                setRoutingControl(routing);
-            }
+            } else {}
         }
         // Inverser l'état du filtre.

[NoCoverage] BooleanLiteral
src/App.js:202:26
             }
         }
         // Inverser l'état du filtre.
-        setToiletChecked(!filterToilet);
+        setToiletChecked(filterToilet);
     };
 

[NoCoverage] BlockStatement
src/App.js:206:35
     };
 
     // Gestionnaire de connexion.
-    const handleLogin = (user) => {
-        setLoggedUser(user);
-    };
+    const handleLogin = (user) => {};
 
     // Filtrer les vélos en fonction de l'utilisateur connecté.

[NoCoverage] ArrayDeclaration
src/App.js:214:54
     const filteredBikes = filterBike ? bikes : [];
 
     // Filtrer les toilettes en fonction de l'utilisateur connecté.
-    const filteredToilets = filterToilet ? toilets : [];
+    const filteredToilets = filterToilet ? toilets : ["Stryker was here"];
 
     // Effets pour récupérer les données des vélos et des toilettes lors du chargement de l'application.

[NoCoverage] BlockStatement
src/App.js:218:43
 
     // Effets pour récupérer les données des vélos et des toilettes lors du chargement de l'application.
     useEffect(() => {
-        const fetchDataBike = async () => {
-            try {
-                const response = await fetch('http://localhost:8080/api/v1/bike');
-                const data = await response.json();
-
-                // Filtrer les doublons dans les données des vélos.
-                const uniqueBikes = data.filter((bike, index, self) =>
-                        index === self.findIndex(b =>
-                            b.latitude === bike.latitude && b.longitude === bike.longitude
-                        )
-                );
-                //Passer le résultat à bikes pour le réutiliser ailleurs
-                setBikes(uniqueBikes);
-            } catch (error) {
-                console.error('Une erreur s\'est produite:', error);
-            }
-        };
+        const fetchDataBike = async () => {};
 
         const fetchDataToilet = async () => {

[NoCoverage] BlockStatement
src/App.js:219:17
     // Effets pour récupérer les données des vélos et des toilettes lors du chargement de l'application.
     useEffect(() => {
         const fetchDataBike = async () => {
-            try {
-                const response = await fetch('http://localhost:8080/api/v1/bike');
-                const data = await response.json();
-
-                // Filtrer les doublons dans les données des vélos.
-                const uniqueBikes = data.filter((bike, index, self) =>
-                        index === self.findIndex(b =>
-                            b.latitude === bike.latitude && b.longitude === bike.longitude
-                        )
-                );
-                //Passer le résultat à bikes pour le réutiliser ailleurs
-                setBikes(uniqueBikes);
-            } catch (error) {
+            try {} catch (error) {
                 console.error('Une erreur s\'est produite:', error);
             }

[NoCoverage] MethodExpression
src/App.js:224:37
                 const data = await response.json();
 
                 // Filtrer les doublons dans les données des vélos.
-                const uniqueBikes = data.filter((bike, index, self) =>
-                        index === self.findIndex(b =>
-                            b.latitude === bike.latitude && b.longitude === bike.longitude
-                        )
-                );
+                const uniqueBikes = data;
                 //Passer le résultat à bikes pour le réutiliser ailleurs
                 setBikes(uniqueBikes);

[NoCoverage] ArrowFunction
src/App.js:224:49
                 const data = await response.json();
 
                 // Filtrer les doublons dans les données des vélos.
-                const uniqueBikes = data.filter((bike, index, self) =>
-                        index === self.findIndex(b =>
-                            b.latitude === bike.latitude && b.longitude === bike.longitude
-                        )
+                const uniqueBikes = data.filter(() => undefined
                 );
                 //Passer le résultat à bikes pour le réutiliser ailleurs

[NoCoverage] ConditionalExpression
src/App.js:225:25
 
                 // Filtrer les doublons dans les données des vélos.
                 const uniqueBikes = data.filter((bike, index, self) =>
-                        index === self.findIndex(b =>
-                            b.latitude === bike.latitude && b.longitude === bike.longitude
-                        )
+                        false
                 );
                 //Passer le résultat à bikes pour le réutiliser ailleurs

[NoCoverage] ArrowFunction
src/App.js:225:50
 
                 // Filtrer les doublons dans les données des vélos.
                 const uniqueBikes = data.filter((bike, index, self) =>
-                        index === self.findIndex(b =>
-                            b.latitude === bike.latitude && b.longitude === bike.longitude
+                        index === self.findIndex(() => undefined
                         )
                 );

[NoCoverage] EqualityOperator
src/App.js:226:61
                 // Filtrer les doublons dans les données des vélos.
                 const uniqueBikes = data.filter((bike, index, self) =>
                         index === self.findIndex(b =>
-                            b.latitude === bike.latitude && b.longitude === bike.longitude
+                            b.latitude === bike.latitude && b.longitude !== bike.longitude
                         )
                 );

[NoCoverage] ConditionalExpression
src/App.js:226:61
                 // Filtrer les doublons dans les données des vélos.
                 const uniqueBikes = data.filter((bike, index, self) =>
                         index === self.findIndex(b =>
-                            b.latitude === bike.latitude && b.longitude === bike.longitude
+                            b.latitude === bike.latitude && true
                         )
                 );

[NoCoverage] BlockStatement
src/App.js:231:29
                 );
                 //Passer le résultat à bikes pour le réutiliser ailleurs
                 setBikes(uniqueBikes);
-            } catch (error) {
-                console.error('Une erreur s\'est produite:', error);
-            }
+            } catch (error) {}
         };
 
