[NoCoverage] BlockStatement
src/App.js:236:45
             }
         };
 
-        const fetchDataToilet = async () => {
-            try {
-                const response = await fetch('http://localhost:8080/api/v1/wc');
-                const data = await response.json();
-
-                // Filtrer les doublons dans les données des toilettes.
-                const uniqueToilets = data.filter((toilet, index, self) =>
-                        index === self.findIndex(t =>
-                            t.latitude === toilet.latitude && t.longitude === toilet.longitude
-                        )
-                );
-                //Passer le résultat à toilets pour le réutiliser ailleurs
-                setToilets(uniqueToilets);
-            } catch (error) {
-                console.error('Une erreur s\'est produite:', error);
-            }
-        };
+        const fetchDataToilet = async () => {};
 
         fetchDataBike();

[NoCoverage] BlockStatement
src/App.js:237:17
         };
 
         const fetchDataToilet = async () => {
-            try {
-                const response = await fetch('http://localhost:8080/api/v1/wc');
-                const data = await response.json();
-
-                // Filtrer les doublons dans les données des toilettes.
-                const uniqueToilets = data.filter((toilet, index, self) =>
-                        index === self.findIndex(t =>
-                            t.latitude === toilet.latitude && t.longitude === toilet.longitude
-                        )
-                );
-                //Passer le résultat à toilets pour le réutiliser ailleurs
-                setToilets(uniqueToilets);
-            } catch (error) {
+            try {} catch (error) {
                 console.error('Une erreur s\'est produite:', error);
             }

[NoCoverage] MethodExpression
src/App.js:242:39
                 const data = await response.json();
 
                 // Filtrer les doublons dans les données des toilettes.
-                const uniqueToilets = data.filter((toilet, index, self) =>
-                        index === self.findIndex(t =>
-                            t.latitude === toilet.latitude && t.longitude === toilet.longitude
-                        )
-                );
+                const uniqueToilets = data;
                 //Passer le résultat à toilets pour le réutiliser ailleurs
                 setToilets(uniqueToilets);

[NoCoverage] ArrowFunction
src/App.js:242:51
                 const data = await response.json();
 
                 // Filtrer les doublons dans les données des toilettes.
-                const uniqueToilets = data.filter((toilet, index, self) =>
-                        index === self.findIndex(t =>
-                            t.latitude === toilet.latitude && t.longitude === toilet.longitude
-                        )
+                const uniqueToilets = data.filter(() => undefined
                 );
                 //Passer le résultat à toilets pour le réutiliser ailleurs

[NoCoverage] EqualityOperator
src/App.js:243:25
 
                 // Filtrer les doublons dans les données des toilettes.
                 const uniqueToilets = data.filter((toilet, index, self) =>
-                        index === self.findIndex(t =>
-                            t.latitude === toilet.latitude && t.longitude === toilet.longitude
-                        )
+                        index !== self.findIndex(t => t.latitude === toilet.latitude && t.longitude === toilet.longitude)
                 );
                 //Passer le résultat à toilets pour le réutiliser ailleurs

[NoCoverage] ArrowFunction
src/App.js:243:50
 
                 // Filtrer les doublons dans les données des toilettes.
                 const uniqueToilets = data.filter((toilet, index, self) =>
-                        index === self.findIndex(t =>
-                            t.latitude === toilet.latitude && t.longitude === toilet.longitude
+                        index === self.findIndex(() => undefined
                         )
                 );

[NoCoverage] ConditionalExpression
src/App.js:244:63
                 // Filtrer les doublons dans les données des toilettes.
                 const uniqueToilets = data.filter((toilet, index, self) =>
                         index === self.findIndex(t =>
-                            t.latitude === toilet.latitude && t.longitude === toilet.longitude
+                            t.latitude === toilet.latitude && true
                         )
                 );

[NoCoverage] EqualityOperator
src/App.js:244:29
                 // Filtrer les doublons dans les données des toilettes.
                 const uniqueToilets = data.filter((toilet, index, self) =>
                         index === self.findIndex(t =>
-                            t.latitude === toilet.latitude && t.longitude === toilet.longitude
+                            t.latitude !== toilet.latitude && t.longitude === toilet.longitude
                         )
                 );

[NoCoverage] BlockStatement
src/App.js:249:29
                 );
                 //Passer le résultat à toilets pour le réutiliser ailleurs
                 setToilets(uniqueToilets);
-            } catch (error) {
-                console.error('Une erreur s\'est produite:', error);
-            }
+            } catch (error) {}
         };
 

[NoCoverage] StringLiteral
src/App.js:250:31
                 //Passer le résultat à toilets pour le réutiliser ailleurs
                 setToilets(uniqueToilets);
             } catch (error) {
-                console.error('Une erreur s\'est produite:', error);
+                console.error("", error);
             }
         };

[NoCoverage] ConditionalExpression
src/App.js:260:13
 
     const getUserLocation = () => {
 
-        if (navigator.geolocation) {
+        if (false) {
             navigator.geolocation.getCurrentPosition(
                 position => {

[NoCoverage] ConditionalExpression
src/App.js:260:13
 
     const getUserLocation = () => {
 
-        if (navigator.geolocation) {
+        if (true) {
             navigator.geolocation.getCurrentPosition(
                 position => {

[NoCoverage] BlockStatement
src/App.js:262:29
 
         if (navigator.geolocation) {
             navigator.geolocation.getCurrentPosition(
-                position => {
-                    setUserLocation([position.coords.latitude, position.coords.longitude]);
-                },
+                position => {},
                 error => {
                     console.error('Une erreur s\'est produite lors de la récupération de la position:', error);

[NoCoverage] StringLiteral
src/App.js:266:35
                     setUserLocation([position.coords.latitude, position.coords.longitude]);
                 },
                 error => {
-                    console.error('Une erreur s\'est produite lors de la récupération de la position:', error);
+                    console.error("", error);
                 }

[NoCoverage] BlockStatement
src/App.js:270:16
                 }
             );
-        } else {
-            console.error('La géolocalisation n\'est pas prise en charge par ce navigateur.');
-            setUserLocation([defaultLatitude, defaultLongitude]);
-        }
+        } else {}
     };
 

[NoCoverage] StringLiteral
src/App.js:271:27
                 }
             );
         } else {
-            console.error('La géolocalisation n\'est pas prise en charge par ce navigateur.');
+            console.error("");
             setUserLocation([defaultLatitude, defaultLongitude]);
         }

[NoCoverage] BlockStatement
src/App.js:277:21
     };
 
 
-    useEffect(() => {
-        getUserLocation();
-    }, []);
+    useEffect(() => {}, []);
 
     // Effet pour récupérer la position de l'utilisateur.

[NoCoverage] BlockStatement
src/App.js:282:21
     }, []);
 
     // Effet pour récupérer la position de l'utilisateur.
-    useEffect(() => {
-        getUserLocation();
-    }, []);
+    useEffect(() => {}, []);
 
     // Effet pour centrer la carte sur la position de l'utilisateur lors de son chargement.

[NoCoverage] BlockStatement
src/App.js:287:21
     }, []);
 
     // Effet pour centrer la carte sur la position de l'utilisateur lors de son chargement.
-    useEffect(() => {
-        if (userLocation && mapRef.current) {
-            mapRef.current.setView(userLocation, 15);
-        }
-    }, [userLocation, mapRef.current]);
+    useEffect(() => {}, [userLocation, mapRef.current]);
 
     // Effet pour réinitialiser l'état de la recherche soumise après qu'elle a été traitée.

[NoCoverage] LogicalOperator
src/App.js:288:13
 
     // Effet pour centrer la carte sur la position de l'utilisateur lors de son chargement.
     useEffect(() => {
-        if (userLocation && mapRef.current) {
+        if (userLocation || mapRef.current) {
             mapRef.current.setView(userLocation, 15);
         }

[NoCoverage] ConditionalExpression
src/App.js:288:13
 
     // Effet pour centrer la carte sur la position de l'utilisateur lors de son chargement.
     useEffect(() => {
-        if (userLocation && mapRef.current) {
+        if (true) {
             mapRef.current.setView(userLocation, 15);
         }

[NoCoverage] BlockStatement
src/App.js:294:21
     }, [userLocation, mapRef.current]);
 
     // Effet pour réinitialiser l'état de la recherche soumise après qu'elle a été traitée.
-    useEffect(() => {
-        if (searchSubmitted && searchLocation) {
-            setSearchSubmitted(false);
-        }
-    }, [searchSubmitted, searchLocation]);
+    useEffect(() => {}, [searchSubmitted, searchLocation]);
 
 

[NoCoverage] ConditionalExpression
src/App.js:295:13
 
     // Effet pour réinitialiser l'état de la recherche soumise après qu'elle a été traitée.
     useEffect(() => {
-        if (searchSubmitted && searchLocation) {
+        if (false) {
             setSearchSubmitted(false);
         }

[NoCoverage] ConditionalExpression
src/App.js:295:13
 
     // Effet pour réinitialiser l'état de la recherche soumise après qu'elle a été traitée.
     useEffect(() => {
-        if (searchSubmitted && searchLocation) {
+        if (true) {
             setSearchSubmitted(false);
         }

[NoCoverage] BooleanLiteral
src/App.js:296:32
     // Effet pour réinitialiser l'état de la recherche soumise après qu'elle a été traitée.
     useEffect(() => {
         if (searchSubmitted && searchLocation) {
-            setSearchSubmitted(false);
+            setSearchSubmitted(true);
         }
     }, [searchSubmitted, searchLocation]);

[NoCoverage] ArrayDeclaration
src/App.js:298:8
         if (searchSubmitted && searchLocation) {
             setSearchSubmitted(false);
         }
-    }, [searchSubmitted, searchLocation]);
+    }, []);
 
 

[NoCoverage] ArrayDeclaration
src/App.js:308:21
      */
     const initRouting = (userLocation, nearestLocation) => {
         // Utilise Promise.all pour importer les dépendances de leaflet-routing-machine
-        Promise.all([
-            import('leaflet-routing-machine'),
-            import('leaflet-routing-machine/dist/leaflet-routing-machine.css')
-        ]).then(([LRoutingMachine, css]) => {
+        Promise.all([]).then(([LRoutingMachine, css]) => {
             // Définit les points de passage pour l'itinéraire
             const waypoints = [

[NoCoverage] StringLiteral
src/App.js:309:20
     const initRouting = (userLocation, nearestLocation) => {
         // Utilise Promise.all pour importer les dépendances de leaflet-routing-machine
         Promise.all([
-            import('leaflet-routing-machine'),
+            import(""),
             import('leaflet-routing-machine/dist/leaflet-routing-machine.css')
         ]).then(([LRoutingMachine, css]) => {

[NoCoverage] StringLiteral
src/App.js:310:20
         // Utilise Promise.all pour importer les dépendances de leaflet-routing-machine
         Promise.all([
             import('leaflet-routing-machine'),
-            import('leaflet-routing-machine/dist/leaflet-routing-machine.css')
+            import("")
         ]).then(([LRoutingMachine, css]) => {
             // Définit les points de passage pour l'itinéraire

[NoCoverage] BlockStatement
src/App.js:319:57
             ];
 
             // Fonction pour créer les marqueurs sur l'itinéraire
-            const createMarker = (waypoint, options) => {
-                if (waypoint && waypoint.latLng) {
-                    // Vérifie si c'est le dernier point de passage pour afficher un marqueur spécial
-                    if (waypoint.isLast) {
-                        const nextWp = waypoint._plan[waypoint._index + 1];
-                        if (nextWp && nextWp.latLng) {
-                            return L.marker(waypoint.latLng, {icon: toiletIcon}); // Utilise une icône spéciale pour la toilette
-                        }
-                    }
-                    return L.marker(waypoint.latLng); // Utilise l'icône par défaut
-                } else {
-                    return null; // Retourne null si le waypoint est invalide
-                }
-            };
+            const createMarker = (waypoint, options) => {};
 
             // Initialise le contrôle de routage avec les waypoints et les options spécifiées

[NoCoverage] ConditionalExpression
src/App.js:320:21
 
             // Fonction pour créer les marqueurs sur l'itinéraire
             const createMarker = (waypoint, options) => {
-                if (waypoint && waypoint.latLng) {
+                if (false) {
                     // Vérifie si c'est le dernier point de passage pour afficher un marqueur spécial
                     if (waypoint.isLast) {

[NoCoverage] BlockStatement
src/App.js:320:50
 
             // Fonction pour créer les marqueurs sur l'itinéraire
             const createMarker = (waypoint, options) => {
-                if (waypoint && waypoint.latLng) {
-                    // Vérifie si c'est le dernier point de passage pour afficher un marqueur spécial
-                    if (waypoint.isLast) {
-                        const nextWp = waypoint._plan[waypoint._index + 1];
-                        if (nextWp && nextWp.latLng) {
-                            return L.marker(waypoint.latLng, {icon: toiletIcon}); // Utilise une icône spéciale pour la toilette
-                        }
-                    }
-                    return L.marker(waypoint.latLng); // Utilise l'icône par défaut
-                } else {
+                if (waypoint && waypoint.latLng) {} else {
                     return null; // Retourne null si le waypoint est invalide
                 }

[NoCoverage] ConditionalExpression
src/App.js:322:25
             const createMarker = (waypoint, options) => {
                 if (waypoint && waypoint.latLng) {
                     // Vérifie si c'est le dernier point de passage pour afficher un marqueur spécial
-                    if (waypoint.isLast) {
+                    if (false) {
                         const nextWp = waypoint._plan[waypoint._index + 1];
                         if (nextWp && nextWp.latLng) {

[NoCoverage] BlockStatement
src/App.js:322:42
             const createMarker = (waypoint, options) => {
                 if (waypoint && waypoint.latLng) {
                     // Vérifie si c'est le dernier point de passage pour afficher un marqueur spécial
-                    if (waypoint.isLast) {
-                        const nextWp = waypoint._plan[waypoint._index + 1];
-                        if (nextWp && nextWp.latLng) {
-                            return L.marker(waypoint.latLng, {icon: toiletIcon}); // Utilise une icône spéciale pour la toilette
-                        }
-                    }
+                    if (waypoint.isLast) {}
                     return L.marker(waypoint.latLng); // Utilise l'icône par défaut
                 } else {

[NoCoverage] ArithmeticOperator
src/App.js:323:55
                 if (waypoint && waypoint.latLng) {
                     // Vérifie si c'est le dernier point de passage pour afficher un marqueur spécial
                     if (waypoint.isLast) {
-                        const nextWp = waypoint._plan[waypoint._index + 1];
+                        const nextWp = waypoint._plan[waypoint._index - 1];
                         if (nextWp && nextWp.latLng) {
                             return L.marker(waypoint.latLng, {icon: toiletIcon}); // Utilise une icône spéciale pour la toilette

[NoCoverage] ConditionalExpression
src/App.js:324:29
                     // Vérifie si c'est le dernier point de passage pour afficher un marqueur spécial
                     if (waypoint.isLast) {
                         const nextWp = waypoint._plan[waypoint._index + 1];
-                        if (nextWp && nextWp.latLng) {
+                        if (true) {
                             return L.marker(waypoint.latLng, {icon: toiletIcon}); // Utilise une icône spéciale pour la toilette
                         }

[NoCoverage] LogicalOperator
src/App.js:324:29
                     // Vérifie si c'est le dernier point de passage pour afficher un marqueur spécial
                     if (waypoint.isLast) {
                         const nextWp = waypoint._plan[waypoint._index + 1];
-                        if (nextWp && nextWp.latLng) {
+                        if (nextWp || nextWp.latLng) {
                             return L.marker(waypoint.latLng, {icon: toiletIcon}); // Utilise une icône spéciale pour la toilette
                         }

[NoCoverage] BlockStatement
src/App.js:329:24
                         }
                     }
                     return L.marker(waypoint.latLng); // Utilise l'icône par défaut
-                } else {
-                    return null; // Retourne null si le waypoint est invalide
-                }
+                } else {}
             };
 

[NoCoverage] ArithmeticOperator
src/App.js:338:38
             const routing = L.Routing.control({
                 waypoints: waypoints,
                 createMarker: createMarker,
-                waypointIndices: [0, waypoints.length - 1], // Indique les indices des points de passage dans le tableau des waypoints
+                waypointIndices: [0, waypoints.length + 1], // Indique les indices des points de passage dans le tableau des waypoints
                 routeWhileDragging: false, // Empêche le calcul automatique de l'itinéraire lors du déplacement des points de passage
                 lineOptions: {

[NoCoverage] BooleanLiteral
src/App.js:339:37
                 waypoints: waypoints,
                 createMarker: createMarker,
                 waypointIndices: [0, waypoints.length - 1], // Indique les indices des points de passage dans le tableau des waypoints
-                routeWhileDragging: false, // Empêche le calcul automatique de l'itinéraire lors du déplacement des points de passage
+                routeWhileDragging: true, // Empêche le calcul automatique de l'itinéraire lors du déplacement des points de passage
                 lineOptions: {
                     styles: [{color: 'blue', opacity: 1, weight: 3}] // Options de style pour la ligne d'itinéraire

[NoCoverage] StringLiteral
src/App.js:341:38
                 waypointIndices: [0, waypoints.length - 1], // Indique les indices des points de passage dans le tableau des waypoints
                 routeWhileDragging: false, // Empêche le calcul automatique de l'itinéraire lors du déplacement des points de passage
                 lineOptions: {
-                    styles: [{color: 'blue', opacity: 1, weight: 3}] // Options de style pour la ligne d'itinéraire
+                    styles: [{color: "", opacity: 1, weight: 3}] // Options de style pour la ligne d'itinéraire
                 },
             }).addTo(mapRef.current); // Ajoute le contrôle de routage à la carte

[NoCoverage] BlockStatement
src/App.js:345:27
                 },
             }).addTo(mapRef.current); // Ajoute le contrôle de routage à la carte
             setRoutingControl(routing); // Met à jour l'état du contrôle de routage
-        }).catch(error => {
-            console.error('Erreur lors du chargement du contrôle de routing :', error); // Gère les erreurs de chargement
-        });
+        }).catch(error => {});
     };
 

[NoCoverage] StringLiteral
src/App.js:346:27
             }).addTo(mapRef.current); // Ajoute le contrôle de routage à la carte
             setRoutingControl(routing); // Met à jour l'état du contrôle de routage
         }).catch(error => {
-            console.error('Erreur lors du chargement du contrôle de routing :', error); // Gère les erreurs de chargement
+            console.error("", error); // Gère les erreurs de chargement
         });
     };

[NoCoverage] ArrayDeclaration
src/App.js:361:25
             import('leaflet-routing-machine'),
             import('leaflet-routing-machine/dist/leaflet-routing-machine.css')
         ]).then(([LRoutingMachine, css]) => {
-            waypoints = [
-                L.latLng(userLocation),
-                L.latLng(nearestLocation[0], nearestLocation[1])
-            ];
+            waypoints = [];
 
             const createMarker = (waypoint, options) => {

[NoCoverage] BlockStatement
src/App.js:366:57
                 L.latLng(nearestLocation[0], nearestLocation[1])
             ];
 
-            const createMarker = (waypoint, options) => {
-                if (waypoint && waypoint.latLng) {
-                    if (waypoint.isLast) {
-                        const nextWp = waypoint._plan[waypoint._index + 1];
-                        if (nextWp && nextWp.latLng) {
-                            return L.marker(waypoint.latLng, {icon: bikeIcon});
-                        }
-                    }
-                    return L.marker(waypoint.latLng);
-                } else {
-                    console.error("Waypoint is undefined or missing latLng property:", waypoint);
-                    return null;
-                }
-            };
+            const createMarker = (waypoint, options) => {};
 
             const routing2 = L.Routing.control({

[NoCoverage] ConditionalExpression
src/App.js:367:21
             ];
 
             const createMarker = (waypoint, options) => {
-                if (waypoint && waypoint.latLng) {
+                if (true) {
                     if (waypoint.isLast) {
                         const nextWp = waypoint._plan[waypoint._index + 1];

[NoCoverage] BlockStatement
src/App.js:367:50
             ];
 
             const createMarker = (waypoint, options) => {
-                if (waypoint && waypoint.latLng) {
-                    if (waypoint.isLast) {
-                        const nextWp = waypoint._plan[waypoint._index + 1];
-                        if (nextWp && nextWp.latLng) {
-                            return L.marker(waypoint.latLng, {icon: bikeIcon});
-                        }
-                    }
-                    return L.marker(waypoint.latLng);
-                } else {
+                if (waypoint && waypoint.latLng) {} else {
                     console.error("Waypoint is undefined or missing latLng property:", waypoint);
                     return null;

[NoCoverage] ConditionalExpression
src/App.js:368:25
 
             const createMarker = (waypoint, options) => {
                 if (waypoint && waypoint.latLng) {
-                    if (waypoint.isLast) {
+                    if (true) {
                         const nextWp = waypoint._plan[waypoint._index + 1];
                         if (nextWp && nextWp.latLng) {

[NoCoverage] ConditionalExpression
src/App.js:368:25
 
             const createMarker = (waypoint, options) => {
                 if (waypoint && waypoint.latLng) {
-                    if (waypoint.isLast) {
+                    if (false) {
                         const nextWp = waypoint._plan[waypoint._index + 1];
                         if (nextWp && nextWp.latLng) {

[NoCoverage] BlockStatement
src/App.js:370:54
                 if (waypoint && waypoint.latLng) {
                     if (waypoint.isLast) {
                         const nextWp = waypoint._plan[waypoint._index + 1];
-                        if (nextWp && nextWp.latLng) {
-                            return L.marker(waypoint.latLng, {icon: bikeIcon});
-                        }
+                        if (nextWp && nextWp.latLng) {}
                     }
                     return L.marker(waypoint.latLng);

[NoCoverage] BlockStatement
src/App.js:375:24
                         }
                     }
                     return L.marker(waypoint.latLng);
-                } else {
-                    console.error("Waypoint is undefined or missing latLng property:", waypoint);
-                    return null;
-                }
+                } else {}
             };
 

[NoCoverage] StringLiteral
src/App.js:376:35
                     }
                     return L.marker(waypoint.latLng);
                 } else {
-                    console.error("Waypoint is undefined or missing latLng property:", waypoint);
+                    console.error("", waypoint);
                     return null;
                 }

[NoCoverage] ObjectLiteral
src/App.js:381:48
                 }
             };
 
-            const routing2 = L.Routing.control({
-                waypoints: waypoints,
-                createMarker: createMarker,
-                waypointIndices: [0, waypoints.length - 1],
-                routeWhileDragging: false,
-                lineOptions: {
-                    styles: [{color: 'red', opacity: 1, weight: 3}]
-                },
-            }).addTo(mapRef.current);
+            const routing2 = L.Routing.control({}).addTo(mapRef.current);
             setRoutingControl2(routing2);
         }).catch(error => {

[NoCoverage] ArithmeticOperator
src/App.js:384:38
             const routing2 = L.Routing.control({
                 waypoints: waypoints,
                 createMarker: createMarker,
-                waypointIndices: [0, waypoints.length - 1],
+                waypointIndices: [0, waypoints.length + 1],
                 routeWhileDragging: false,
                 lineOptions: {

[NoCoverage] ArrayDeclaration
src/App.js:384:34
             const routing2 = L.Routing.control({
                 waypoints: waypoints,
                 createMarker: createMarker,
-                waypointIndices: [0, waypoints.length - 1],
+                waypointIndices: [],
                 routeWhileDragging: false,
                 lineOptions: {

[NoCoverage] BooleanLiteral
src/App.js:385:37
                 waypoints: waypoints,
                 createMarker: createMarker,
                 waypointIndices: [0, waypoints.length - 1],
-                routeWhileDragging: false,
+                routeWhileDragging: true,
                 lineOptions: {
                     styles: [{color: 'red', opacity: 1, weight: 3}]

[NoCoverage] ObjectLiteral
src/App.js:387:30
                 waypointIndices: [0, waypoints.length - 1],
                 routeWhileDragging: false,
                 lineOptions: {
-                    styles: [{color: 'red', opacity: 1, weight: 3}]
+                    styles: [{}]
                 },
             }).addTo(mapRef.current);

[NoCoverage] ArrayDeclaration
src/App.js:387:29
                 waypointIndices: [0, waypoints.length - 1],
                 routeWhileDragging: false,
                 lineOptions: {
-                    styles: [{color: 'red', opacity: 1, weight: 3}]
+                    styles: []
                 },
             }).addTo(mapRef.current);

[NoCoverage] BlockStatement
src/App.js:391:27
                 },
             }).addTo(mapRef.current);
             setRoutingControl2(routing2);
-        }).catch(error => {
-            console.error('Erreur lors du chargement du contrôle de routing :', error);
-        });
+        }).catch(error => {});
     };
 

[NoCoverage] BlockStatement
src/App.js:397:21
     };
 
     // Effet pour initialiser le routing vers la toilette la plus proche lors du chargement de l'application.
-    useEffect(() => {
-        if (userLocation && mapRef.current) {
-            const nearestToilet = findNearestToilet(userLocation, toilets);
-            if (nearestToilet) {
-                const nearestToiletLocation = [nearestToilet.latitude, nearestToilet.longitude];
-                initRouting(userLocation, nearestToiletLocation, true);
-            }
-        }
-    }, [userLocation, toilets]);
+    useEffect(() => {}, [userLocation, toilets]);
 
     // Effet pour initialiser le routing vers le vélo le plus proche lors du chargement de l'application.

[NoCoverage] ConditionalExpression
src/App.js:398:13
 
     // Effet pour initialiser le routing vers la toilette la plus proche lors du chargement de l'application.
     useEffect(() => {
-        if (userLocation && mapRef.current) {
+        if (false) {
             const nearestToilet = findNearestToilet(userLocation, toilets);
             if (nearestToilet) {

[NoCoverage] ConditionalExpression
src/App.js:400:17
     useEffect(() => {
         if (userLocation && mapRef.current) {
             const nearestToilet = findNearestToilet(userLocation, toilets);
-            if (nearestToilet) {
+            if (true) {
                 const nearestToiletLocation = [nearestToilet.latitude, nearestToilet.longitude];
                 initRouting(userLocation, nearestToiletLocation, true);
