[NoCoverage] BlockStatement
src/App.js:400:32
     useEffect(() => {
         if (userLocation && mapRef.current) {
             const nearestToilet = findNearestToilet(userLocation, toilets);
-            if (nearestToilet) {
-                const nearestToiletLocation = [nearestToilet.latitude, nearestToilet.longitude];
-                initRouting(userLocation, nearestToiletLocation, true);
-            }
+            if (nearestToilet) {}
         }
     }, [userLocation, toilets]);

[NoCoverage] ArrayDeclaration
src/App.js:401:47
         if (userLocation && mapRef.current) {
             const nearestToilet = findNearestToilet(userLocation, toilets);
             if (nearestToilet) {
-                const nearestToiletLocation = [nearestToilet.latitude, nearestToilet.longitude];
+                const nearestToiletLocation = [];
                 initRouting(userLocation, nearestToiletLocation, true);
             }

[NoCoverage] BooleanLiteral
src/App.js:402:66
             const nearestToilet = findNearestToilet(userLocation, toilets);
             if (nearestToilet) {
                 const nearestToiletLocation = [nearestToilet.latitude, nearestToilet.longitude];
-                initRouting(userLocation, nearestToiletLocation, true);
+                initRouting(userLocation, nearestToiletLocation, false);
             }
         }

[NoCoverage] BlockStatement
src/App.js:408:21
     }, [userLocation, toilets]);
 
     // Effet pour initialiser le routing vers le vélo le plus proche lors du chargement de l'application.
-    useEffect(() => {
-        if (userLocation && mapRef.current) {
-            const nearestBike = findNearestBike(userLocation, bikes);
-            if (nearestBike) {
-                const nearestBikeLocation = [nearestBike.latitude, nearestBike.longitude];
-                initRouting2(userLocation, nearestBikeLocation, false);
-            }
-        }
-    }, [userLocation, bikes]);
+    useEffect(() => {}, [userLocation, bikes]);
 
     // Markeur qui affiche une popUp sur la position de l'utilisateur

[NoCoverage] BlockStatement
src/App.js:409:45
 
     // Effet pour initialiser le routing vers le vélo le plus proche lors du chargement de l'application.
     useEffect(() => {
-        if (userLocation && mapRef.current) {
-            const nearestBike = findNearestBike(userLocation, bikes);
-            if (nearestBike) {
-                const nearestBikeLocation = [nearestBike.latitude, nearestBike.longitude];
-                initRouting2(userLocation, nearestBikeLocation, false);
-            }
-        }
+        if (userLocation && mapRef.current) {}
     }, [userLocation, bikes]);
 

[NoCoverage] ConditionalExpression
src/App.js:411:17
     useEffect(() => {
         if (userLocation && mapRef.current) {
             const nearestBike = findNearestBike(userLocation, bikes);
-            if (nearestBike) {
+            if (true) {
                 const nearestBikeLocation = [nearestBike.latitude, nearestBike.longitude];
                 initRouting2(userLocation, nearestBikeLocation, false);

[NoCoverage] ConditionalExpression
src/App.js:411:17
     useEffect(() => {
         if (userLocation && mapRef.current) {
             const nearestBike = findNearestBike(userLocation, bikes);
-            if (nearestBike) {
+            if (false) {
                 const nearestBikeLocation = [nearestBike.latitude, nearestBike.longitude];
                 initRouting2(userLocation, nearestBikeLocation, false);

[NoCoverage] BooleanLiteral
src/App.js:413:65
             const nearestBike = findNearestBike(userLocation, bikes);
             if (nearestBike) {
                 const nearestBikeLocation = [nearestBike.latitude, nearestBike.longitude];
-                initRouting2(userLocation, nearestBikeLocation, false);
+                initRouting2(userLocation, nearestBikeLocation, true);
             }
         }

[NoCoverage] ObjectLiteral
src/App.js:420:9
 
     // Markeur qui affiche une popUp sur la position de l'utilisateur
     const markers = userLocation ? [
-        {
-            geocode: [userLocation[0], userLocation[1]],
-            popUp: "Vous êtes ici"
-        }
+        {}
     ] : [];
 

[NoCoverage] ArrayDeclaration
src/App.js:424:9
             geocode: [userLocation[0], userLocation[1]],
             popUp: "Vous êtes ici"
         }
-    ] : [];
+    ] : ["Stryker was here"];
 
     /**

[NoCoverage] BlockStatement
src/App.js:430:59
      * Fonction asynchrone pour laisser un avis sur une toilette en effectuant une requête vers l'API.
      * Cette fonction prend en paramètres l'identifiant de la toilette, l'identifiant de l'utilisateur et la note attribuée.
      */
-    const LaisserAvis = async (idToilet, idUser, note) => {
-        try {
-            // Envoi d'une requête GET à l'API avec les données nécessaires pour laisser un avis
-            const response = await fetch(`http://127.0.0.1:8080/api/v1/user/${idUser}/${idToilet}/${note}`, {
-                method: "GET",
-                headers: {
-                    "Content-Type": "application/json"
-                }
-            });
-
-            // Vérification du statut de la réponse de la requête
-            if (response.status === 200) {
-                // Si la requête est réussie (statut 200), définir l'état "newAvis" sur "OK"
-                setNewAvis("OK");
-            } else {
-                // Si la requête échoue, définir l'état "newAvis" sur "KO"
-                setNewAvis("KO");
-            }
-        } catch (error) {
-            // Gestion des erreurs en cas d'échec de la requête
-            console.error("Erreur lors de l'envoi de la requête :", error);
-        }
-    };
+    const LaisserAvis = async (idToilet, idUser, note) => {};
 
     /**

[NoCoverage] BlockStatement
src/App.js:431:13
      * Cette fonction prend en paramètres l'identifiant de la toilette, l'identifiant de l'utilisateur et la note attribuée.
      */
     const LaisserAvis = async (idToilet, idUser, note) => {
-        try {
-            // Envoi d'une requête GET à l'API avec les données nécessaires pour laisser un avis
-            const response = await fetch(`http://127.0.0.1:8080/api/v1/user/${idUser}/${idToilet}/${note}`, {
-                method: "GET",
-                headers: {
-                    "Content-Type": "application/json"
-                }
-            });
-
-            // Vérification du statut de la réponse de la requête
-            if (response.status === 200) {
-                // Si la requête est réussie (statut 200), définir l'état "newAvis" sur "OK"
-                setNewAvis("OK");
-            } else {
-                // Si la requête échoue, définir l'état "newAvis" sur "KO"
-                setNewAvis("KO");
-            }
-        } catch (error) {
+        try {} catch (error) {
             // Gestion des erreurs en cas d'échec de la requête
             console.error("Erreur lors de l'envoi de la requête :", error);

[NoCoverage] ObjectLiteral
src/App.js:435:26
             // Envoi d'une requête GET à l'API avec les données nécessaires pour laisser un avis
             const response = await fetch(`http://127.0.0.1:8080/api/v1/user/${idUser}/${idToilet}/${note}`, {
                 method: "GET",
-                headers: {
-                    "Content-Type": "application/json"
-                }
+                headers: {}
             });
 

[NoCoverage] BlockStatement
src/App.js:441:42
             });
 
             // Vérification du statut de la réponse de la requête
-            if (response.status === 200) {
-                // Si la requête est réussie (statut 200), définir l'état "newAvis" sur "OK"
-                setNewAvis("OK");
-            } else {
+            if (response.status === 200) {} else {
                 // Si la requête échoue, définir l'état "newAvis" sur "KO"
                 setNewAvis("KO");

[NoCoverage] ConditionalExpression
src/App.js:441:17
             });
 
             // Vérification du statut de la réponse de la requête
-            if (response.status === 200) {
+            if (false) {
                 // Si la requête est réussie (statut 200), définir l'état "newAvis" sur "OK"
                 setNewAvis("OK");

[NoCoverage] StringLiteral
src/App.js:443:28
             // Vérification du statut de la réponse de la requête
             if (response.status === 200) {
                 // Si la requête est réussie (statut 200), définir l'état "newAvis" sur "OK"
-                setNewAvis("OK");
+                setNewAvis("");
             } else {
                 // Si la requête échoue, définir l'état "newAvis" sur "KO"

[NoCoverage] BlockStatement
src/App.js:444:20
             if (response.status === 200) {
                 // Si la requête est réussie (statut 200), définir l'état "newAvis" sur "OK"
                 setNewAvis("OK");
-            } else {
-                // Si la requête échoue, définir l'état "newAvis" sur "KO"
-                setNewAvis("KO");
-            }
+            } else {}
         } catch (error) {
             // Gestion des erreurs en cas d'échec de la requête

[NoCoverage] BlockStatement
src/App.js:448:25
                 // Si la requête échoue, définir l'état "newAvis" sur "KO"
                 setNewAvis("KO");
             }
-        } catch (error) {
-            // Gestion des erreurs en cas d'échec de la requête
-            console.error("Erreur lors de l'envoi de la requête :", error);
-        }
+        } catch (error) {}
     };
 

[NoCoverage] BlockStatement
src/App.js:458:38
     * Fonction pour laisser un avis sur une toilette avec vérification de la connexion de l'utilisateur.
     * Cette fonction prend en paramètres l'identifiant de la toilette et la note attribuée.
     */
-    const Avis = (idToilet, note) => {
-        // Vérifier si un utilisateur est connecté et si l'identifiant de la toilette est défini
-        if (loggedUser != null && idToilet != null) {
-            // Si un utilisateur est connecté et l'identifiant de la toilette est défini, appeler la fonction pour laisser un avis
-            LaisserAvis(idToilet, loggedUser.login, note);
-        } else {
-            // Sinon, afficher une alerte demandant à l'utilisateur de se connecter
-            showCustomAlert("Veuillez vous connecter !", "Connexion Alert");
-        }
-    };
+    const Avis = (idToilet, note) => {};
 
     /**

[NoCoverage] LogicalOperator
src/App.js:460:13
     */
     const Avis = (idToilet, note) => {
         // Vérifier si un utilisateur est connecté et si l'identifiant de la toilette est défini
-        if (loggedUser != null && idToilet != null) {
+        if (loggedUser != null || idToilet != null) {
             // Si un utilisateur est connecté et l'identifiant de la toilette est défini, appeler la fonction pour laisser un avis
             LaisserAvis(idToilet, loggedUser.login, note);

[NoCoverage] EqualityOperator
src/App.js:460:35
     */
     const Avis = (idToilet, note) => {
         // Vérifier si un utilisateur est connecté et si l'identifiant de la toilette est défini
-        if (loggedUser != null && idToilet != null) {
+        if (loggedUser != null && idToilet == null) {
             // Si un utilisateur est connecté et l'identifiant de la toilette est défini, appeler la fonction pour laisser un avis
             LaisserAvis(idToilet, loggedUser.login, note);

[NoCoverage] BlockStatement
src/App.js:463:16
         if (loggedUser != null && idToilet != null) {
             // Si un utilisateur est connecté et l'identifiant de la toilette est défini, appeler la fonction pour laisser un avis
             LaisserAvis(idToilet, loggedUser.login, note);
-        } else {
-            // Sinon, afficher une alerte demandant à l'utilisateur de se connecter
-            showCustomAlert("Veuillez vous connecter !", "Connexion Alert");
-        }
+        } else {}
     };
 

[NoCoverage] StringLiteral
src/App.js:465:58
             LaisserAvis(idToilet, loggedUser.login, note);
         } else {
             // Sinon, afficher une alerte demandant à l'utilisateur de se connecter
-            showCustomAlert("Veuillez vous connecter !", "Connexion Alert");
+            showCustomAlert("Veuillez vous connecter !", "");
         }
     };

[NoCoverage] ConditionalExpression
src/App.js:478:13
     *  L'état "newAvis" est réinitialisé à "KO" pour attendre le prochain avis.
      */
     useEffect(() => {
-        if (newAvis === "OK") {
+        if (false) {
             // Fonction asynchrone pour récupérer les données des toilettes après avoir laissé un avis
             const fetchDataToilet = async () => {

[NoCoverage] EqualityOperator
src/App.js:478:13
     *  L'état "newAvis" est réinitialisé à "KO" pour attendre le prochain avis.
      */
     useEffect(() => {
-        if (newAvis === "OK") {
+        if (newAvis !== "OK") {
             // Fonction asynchrone pour récupérer les données des toilettes après avoir laissé un avis
             const fetchDataToilet = async () => {

[NoCoverage] BlockStatement
src/App.js:480:49
     useEffect(() => {
         if (newAvis === "OK") {
             // Fonction asynchrone pour récupérer les données des toilettes après avoir laissé un avis
-            const fetchDataToilet = async () => {
-                try {
-                    // Récupération des données des toilettes depuis l'API
-                    const response = await fetch('http://localhost:8080/api/v1/wc');
-                    const data = await response.json();
-
-                    // Filtrage des doublons dans les données des toilettes pour éviter les répétitions
-                    const uniqueToilets = data.filter((toilet, index, self) =>
-                            index === self.findIndex(t =>
-                                t.latitude === toilet.latitude && t.longitude === toilet.longitude
-                            )
-                    );
-
-                    // Mise à jour des données des toilettes dans l'état de l'application
-                    setToilets(uniqueToilets);
-                } catch (error) {
-                    console.error('Une erreur s\'est produite lors de la récupération des données des toilettes:', error);
-                }
-            };
+            const fetchDataToilet = async () => {};
 
             // Appel de la fonction pour récupérer les données des toilettes

[NoCoverage] BlockStatement
src/App.js:481:21
         if (newAvis === "OK") {
             // Fonction asynchrone pour récupérer les données des toilettes après avoir laissé un avis
             const fetchDataToilet = async () => {
-                try {
-                    // Récupération des données des toilettes depuis l'API
-                    const response = await fetch('http://localhost:8080/api/v1/wc');
-                    const data = await response.json();
-
-                    // Filtrage des doublons dans les données des toilettes pour éviter les répétitions
-                    const uniqueToilets = data.filter((toilet, index, self) =>
-                            index === self.findIndex(t =>
-                                t.latitude === toilet.latitude && t.longitude === toilet.longitude
-                            )
-                    );
-
-                    // Mise à jour des données des toilettes dans l'état de l'application
-                    setToilets(uniqueToilets);
-                } catch (error) {
+                try {} catch (error) {
                     console.error('Une erreur s\'est produite lors de la récupération des données des toilettes:', error);
                 }

[NoCoverage] MethodExpression
src/App.js:487:43
                     const data = await response.json();
 
                     // Filtrage des doublons dans les données des toilettes pour éviter les répétitions
-                    const uniqueToilets = data.filter((toilet, index, self) =>
-                            index === self.findIndex(t =>
-                                t.latitude === toilet.latitude && t.longitude === toilet.longitude
-                            )
-                    );
+                    const uniqueToilets = data;
 
                     // Mise à jour des données des toilettes dans l'état de l'application

[NoCoverage] ArrowFunction
src/App.js:487:55
                     const data = await response.json();
 
                     // Filtrage des doublons dans les données des toilettes pour éviter les répétitions
-                    const uniqueToilets = data.filter((toilet, index, self) =>
-                            index === self.findIndex(t =>
-                                t.latitude === toilet.latitude && t.longitude === toilet.longitude
-                            )
+                    const uniqueToilets = data.filter(() => undefined
                     );
 

[NoCoverage] ConditionalExpression
src/App.js:488:29
 
                     // Filtrage des doublons dans les données des toilettes pour éviter les répétitions
                     const uniqueToilets = data.filter((toilet, index, self) =>
-                            index === self.findIndex(t =>
-                                t.latitude === toilet.latitude && t.longitude === toilet.longitude
-                            )
+                            true
                     );
 

[NoCoverage] ConditionalExpression
src/App.js:489:33
                     // Filtrage des doublons dans les données des toilettes pour éviter les répétitions
                     const uniqueToilets = data.filter((toilet, index, self) =>
                             index === self.findIndex(t =>
-                                t.latitude === toilet.latitude && t.longitude === toilet.longitude
+                                false
                             )
                     );

[NoCoverage] LogicalOperator
src/App.js:489:33
                     // Filtrage des doublons dans les données des toilettes pour éviter les répétitions
                     const uniqueToilets = data.filter((toilet, index, self) =>
                             index === self.findIndex(t =>
-                                t.latitude === toilet.latitude && t.longitude === toilet.longitude
+                                t.latitude === toilet.latitude || t.longitude === toilet.longitude
                             )
                     );

[NoCoverage] BlockStatement
src/App.js:495:33
 
                     // Mise à jour des données des toilettes dans l'état de l'application
                     setToilets(uniqueToilets);
-                } catch (error) {
-                    console.error('Une erreur s\'est produite lors de la récupération des données des toilettes:', error);
-                }
+                } catch (error) {}
             };
 

[NoCoverage] ConditionalExpression
src/App.js:504:17
             fetchDataToilet();
 
             // Suppression du contrôle de routing existant de la carte après avoir laissé un nouvel avis
-            if (routingControl != null) {
+            if (true) {
                 mapRef.current.removeControl(routingControl);
             }

[NoCoverage] EqualityOperator
src/App.js:504:17
             fetchDataToilet();
 
             // Suppression du contrôle de routing existant de la carte après avoir laissé un nouvel avis
-            if (routingControl != null) {
+            if (routingControl == null) {
                 mapRef.current.removeControl(routingControl);
             }

[NoCoverage] StringLiteral
src/App.js:509:24
             }
 
             // Réinitialisation de l'état "newAvis" à "KO" pour attendre le prochain avis
-            setNewAvis("KO");
+            setNewAvis("");
         }
     }, [newAvis]);

[NoCoverage] BlockStatement
src/App.js:519:52
     * Si la position est obtenue avec succès, elle met à jour l'état de l'emplacement de l'utilisateur.
     * Si une erreur se produit lors de la récupération de la position, elle est capturée et affichée dans la console.
      */
-    const checkGeolocationPermission = async () => {
-        try {
-            const position = await getUserLocation();
-            mapRef.current.removeControl(routingControl);
-            mapRef.current.removeControl(routingControl2);
-            if (position) {
-                setUserLocation([position.coords.latitude, position.coords.longitude]);
-            }
-        } catch (error) {
-            console.error('Une erreur s\'est produite lors de la récupération de la position:', error);
-        }
-    };
+    const checkGeolocationPermission = async () => {};
 
     return (

[NoCoverage] BlockStatement
src/App.js:520:13
     * Si une erreur se produit lors de la récupération de la position, elle est capturée et affichée dans la console.
      */
     const checkGeolocationPermission = async () => {
-        try {
-            const position = await getUserLocation();
-            mapRef.current.removeControl(routingControl);
-            mapRef.current.removeControl(routingControl2);
-            if (position) {
-                setUserLocation([position.coords.latitude, position.coords.longitude]);
-            }
-        } catch (error) {
+        try {} catch (error) {
             console.error('Une erreur s\'est produite lors de la récupération de la position:', error);
         }

[NoCoverage] BlockStatement
src/App.js:524:27
             const position = await getUserLocation();
             mapRef.current.removeControl(routingControl);
             mapRef.current.removeControl(routingControl2);
-            if (position) {
-                setUserLocation([position.coords.latitude, position.coords.longitude]);
-            }
+            if (position) {}
         } catch (error) {
             console.error('Une erreur s\'est produite lors de la récupération de la position:', error);

[NoCoverage] ConditionalExpression
src/App.js:524:17
             const position = await getUserLocation();
             mapRef.current.removeControl(routingControl);
             mapRef.current.removeControl(routingControl2);
-            if (position) {
+            if (false) {
                 setUserLocation([position.coords.latitude, position.coords.longitude]);
             }

[NoCoverage] BlockStatement
src/App.js:527:25
             if (position) {
                 setUserLocation([position.coords.latitude, position.coords.longitude]);
             }
-        } catch (error) {
-            console.error('Une erreur s\'est produite lors de la récupération de la position:', error);
-        }
+        } catch (error) {}
     };
 

[NoCoverage] UnaryOperator
src/App.js:577:66
                     </div>
                 </div>
                 <div className="col-2">
-                    <MapContainer id="mapid" center={[47.216671, -1.55]} zoom={10} minZoom={12}
+                    <MapContainer id="mapid" center={[47.216671, +1.55]} zoom={10} minZoom={12}
                                   style={{ height: "100%", width: "90%" }} ref={mapRef}>
                         {searchSubmitted && <SearchMap searchLocation={searchLocation}/>}

[NoCoverage] ArrayDeclaration
src/App.js:577:54
                     </div>
                 </div>
                 <div className="col-2">
-                    <MapContainer id="mapid" center={[47.216671, -1.55]} zoom={10} minZoom={12}
+                    <MapContainer id="mapid" center={[]} zoom={10} minZoom={12}
                                   style={{ height: "100%", width: "90%" }} ref={mapRef}>
                         {searchSubmitted && <SearchMap searchLocation={searchLocation}/>}

[NoCoverage] ObjectLiteral
src/App.js:578:42
                 </div>
                 <div className="col-2">
                     <MapContainer id="mapid" center={[47.216671, -1.55]} zoom={10} minZoom={12}
-                                  style={{ height: "100%", width: "90%" }} ref={mapRef}>
+                                  style={{}} ref={mapRef}>
                         {searchSubmitted && <SearchMap searchLocation={searchLocation}/>}
                         <TileLayer url="https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png"/>

[NoCoverage] ConditionalExpression
src/App.js:579:26
                 <div className="col-2">
                     <MapContainer id="mapid" center={[47.216671, -1.55]} zoom={10} minZoom={12}
                                   style={{ height: "100%", width: "90%" }} ref={mapRef}>
-                        {searchSubmitted && <SearchMap searchLocation={searchLocation}/>}
+                        {true}
                         <TileLayer url="https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png"/>
                         {markers.map((marker, index) => (

[NoCoverage] LogicalOperator
src/App.js:579:26
                 <div className="col-2">
                     <MapContainer id="mapid" center={[47.216671, -1.55]} zoom={10} minZoom={12}
                                   style={{ height: "100%", width: "90%" }} ref={mapRef}>
-                        {searchSubmitted && <SearchMap searchLocation={searchLocation}/>}
+                        {searchSubmitted || <SearchMap searchLocation={searchLocation} />}
                         <TileLayer url="https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png"/>
                         {markers.map((marker, index) => (

[NoCoverage] ArrowFunction
src/App.js:581:38
                                   style={{ height: "100%", width: "90%" }} ref={mapRef}>
                         {searchSubmitted && <SearchMap searchLocation={searchLocation}/>}
                         <TileLayer url="https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png"/>
-                        {markers.map((marker, index) => (
-                            <Marker key={index} position={marker.geocode} icon={customIcon}>
-                                <Popup>{marker.popUp}</Popup>
-                            </Marker>
-                        ))}
+                        {markers.map(() => undefined)}
                         <MarkerClusterGroup
                             showCoverageOnHover={false}

[NoCoverage] BooleanLiteral
src/App.js:587:50
                             </Marker>
                         ))}
                         <MarkerClusterGroup
-                            showCoverageOnHover={false}
+                            showCoverageOnHover={true}
                             disableClusteringAtZoom={15}
                             iconCreateFunction={bikeClusterCustomIcon}

[NoCoverage] ArrowFunction
src/App.js:591:48
                             disableClusteringAtZoom={15}
                             iconCreateFunction={bikeClusterCustomIcon}
                         >
-                            {filteredBikes.map(bike => (
-                                <Marker key={bike.id} position={[bike.latitude, bike.longitude]} icon={bikeIcon}
-                                        eventHandlers={{ click: () => handleBikeMarkerClick(bike) }}>
-                                    <CustomPopupBike>
-                                        <strong>Nom de la station :</strong> {bike.nom}<br/>
-                                        <p>Nombre de vélos disponibles : {bike.nombreDeVeloDisponibles}</p>
-                                        <p>Nombre de bornes disponibles : {bike.nombreDeBorneDisponible}</p>
-                                    </CustomPopupBike>
-                                </Marker>
-                            ))}
+                            {filteredBikes.map(() => undefined)}
                         </MarkerClusterGroup>
                         <MarkerClusterGroup

[NoCoverage] ArrowFunction
src/App.js:593:65
                         >
                             {filteredBikes.map(bike => (
                                 <Marker key={bike.id} position={[bike.latitude, bike.longitude]} icon={bikeIcon}
-                                        eventHandlers={{ click: () => handleBikeMarkerClick(bike) }}>
+                                        eventHandlers={{ click: () => undefined }}>
                                     <CustomPopupBike>
                                         <strong>Nom de la station :</strong> {bike.nom}<br/>

[NoCoverage] ArrowFunction
src/App.js:608:146
                             iconCreateFunction={toiletClusterCustomIcon}
                         >
                             {filteredToilets.map(toilet => (
-                                <Marker key={toilet.id} position={[toilet.latitude, toilet.longitude]} icon={toiletIcon} eventHandlers={{ click: () => handleToiletMarkerClick(toilet) }}>
+                                <Marker key={toilet.id} position={[toilet.latitude, toilet.longitude]} icon={toiletIcon} eventHandlers={{ click: () => undefined }}>
                                     <CustomPopupToilet>
                                         <br/>

[NoCoverage] ObjectLiteral
src/App.js:608:137
                             iconCreateFunction={toiletClusterCustomIcon}
                         >
                             {filteredToilets.map(toilet => (
-                                <Marker key={toilet.id} position={[toilet.latitude, toilet.longitude]} icon={toiletIcon} eventHandlers={{ click: () => handleToiletMarkerClick(toilet) }}>
+                                <Marker key={toilet.id} position={[toilet.latitude, toilet.longitude]} icon={toiletIcon} eventHandlers={{}}>
                                     <CustomPopupToilet>
                                         <br/>
