[NoCoverage] ArrowFunction
src/App.js:630:66
                                             </div>
                                             <div className="laisseAvis">
                                                 <button className="custom-btn btn-12"
-                                                        onClick={() => Avis(toilet.identifiant, document.getElementById("note").value)}><span>Cliquez !</span><span>Laissez Avis</span>
+                                                        onClick={() => undefined}><span>Cliquez !</span><span>Laissez Avis</span>
                                                 </button>
                                             </div>
