[NoCoverage] BlockStatement
src/LeafletIcons.js:10:57
  * @param {L.MarkerClusterGroup} cluster - Groupe de marqueurs de regroupement.
  * @returns {L.DivIcon} Icône de regroupement personnalisée.
  */
-export const bikeClusterCustomIcon = function (cluster) {
-    return L.divIcon({
-        html: `<span class="cluster-icon">${cluster.getChildCount()}</span>`,
-        className: "bike-cluster",
-        iconSize: L.point(33, 33, true)
-    });
-};
+export const bikeClusterCustomIcon = function (cluster) {};
 
 /**

[NoCoverage] StringLiteral
src/LeafletIcons.js:12:15
  */
 export const bikeClusterCustomIcon = function (cluster) {
     return L.divIcon({
-        html: `<span class="cluster-icon">${cluster.getChildCount()}</span>`,
+        html: ``,
         className: "bike-cluster",
         iconSize: L.point(33, 33, true)

[NoCoverage] StringLiteral
src/LeafletIcons.js:13:20
 export const bikeClusterCustomIcon = function (cluster) {
     return L.divIcon({
         html: `<span class="cluster-icon">${cluster.getChildCount()}</span>`,
-        className: "bike-cluster",
+        className: "",
         iconSize: L.point(33, 33, true)
     });

[NoCoverage] BooleanLiteral
src/LeafletIcons.js:14:35
     return L.divIcon({
         html: `<span class="cluster-icon">${cluster.getChildCount()}</span>`,
         className: "bike-cluster",
-        iconSize: L.point(33, 33, true)
+        iconSize: L.point(33, 33, false)
     });
 };

[NoCoverage] BlockStatement
src/LeafletIcons.js:23:59
  * @param {L.MarkerClusterGroup} cluster - Groupe de marqueurs de regroupement.
  * @returns {L.DivIcon} Icône de regroupement personnalisée.
  */
-export const toiletClusterCustomIcon = function (cluster) {
-    return L.divIcon({
-        html: `<span class="cluster-icon">${cluster.getChildCount()}</span>`,
-        className: "toilet-cluster",
-        iconSize: L.point(33, 33, true)
-    });
-};
+export const toiletClusterCustomIcon = function (cluster) {};
 
 /**

[NoCoverage] StringLiteral
src/LeafletIcons.js:26:20
 export const toiletClusterCustomIcon = function (cluster) {
     return L.divIcon({
         html: `<span class="cluster-icon">${cluster.getChildCount()}</span>`,
-        className: "toilet-cluster",
+        className: "",
         iconSize: L.point(33, 33, true)
     });

[NoCoverage] BooleanLiteral
src/LeafletIcons.js:27:35
     return L.divIcon({
         html: `<span class="cluster-icon">${cluster.getChildCount()}</span>`,
         className: "toilet-cluster",
-        iconSize: L.point(33, 33, true)
+        iconSize: L.point(33, 33, false)
     });
 };

[NoCoverage] ArrayDeclaration
src/LeafletIcons.js:36:15
  */
 export const customIcon = new Icon({
     iconUrl: require("./icons/repere.png"),
-    iconSize: [45, 45]
+    iconSize: []
 });
 

[NoCoverage] ObjectLiteral
src/LeafletIcons.js:42:32
 /**
  * Icône pour les stations de vélos.
  */
-export const bikeIcon = L.icon({
-    iconUrl: bikeIconUrl,
-    iconSize: [50, 50],
-});
+export const bikeIcon = L.icon({});
 
 /**

[NoCoverage] ArrayDeclaration
src/LeafletIcons.js:44:15
  */
 export const bikeIcon = L.icon({
     iconUrl: bikeIconUrl,
-    iconSize: [50, 50],
+    iconSize: [],
 });
 
