[NoCoverage] BlockStatement
src/customPopUp.js:11:52
  * @param {JSX.Element} props.children - Contenu du popup.
  * @returns {JSX.Element} Popup personnalisé pour les toilettes.
  */
-export const CustomPopupToilet = ({ children }) => {
-    return (
-        <Popup className="popUp">
-            <div>
-                <h3>Informations Complémentaires :</h3>
-                <br/>
-                <img src={toiletIconUrl} width="150" height="130"/>
-                <div>
-                    {children}
-                </div>
-            </div>
-        </Popup>
-    );
-};
+export const CustomPopupToilet = ({ children }) => {};
 
 /**

[NoCoverage] BlockStatement
src/customPopUp.js:32:50
  * @param {JSX.Element} props.children - Contenu du popup.
  * @returns {JSX.Element} Popup personnalisé pour les vélos.
  */
-export const CustomPopupBike = ({ children }) => {
-    return (
-        <Popup className="popUp">
-            <div>
-                <h3>Informations Complémentaires :</h3>
-                <br/>
-                <img src={bikeIconUrl} width="100" height="100"/>
-                <div>
-                    {children}
-                </div>
-            </div>
-        </Popup>
-    );
-};
+export const CustomPopupBike = ({ children }) => {};
