[Killed] BlockStatement
src/CalculDistance.js:10:46
  * @param {number} lon2 - Longitude du deuxième point en degrés.
  * @returns {number} La distance entre les deux points en kilomètres.
  */
-const distance = (lat1, lon1, lat2, lon2) => {
-    const R = 6371; // Rayon de la Terre en kilomètres.
-    const dLat = (lat2 - lat1) * (Math.PI / 180); // Différence de latitude convertie en radians.
-    const dLon = (lon2 - lon1) * (Math.PI / 180); // Différence de longitude convertie en radians.
-    const a =
-        Math.sin(dLat / 2) * Math.sin(dLat / 2) +
-        Math.cos(lat1 * (Math.PI / 180)) * Math.cos(lat2 * (Math.PI / 180)) *
-        Math.sin(dLon / 2) * Math.sin(dLon / 2); // Calcul de la formule de la distance haversine.
-    const c = 2 * Math.atan2(Math.sqrt(a), Math.sqrt(1 - a)); // Calcul de l'angle central.
-    const d = R * c; // Distance calculée en multipliant l'angle central par le rayon de la Terre.
-    return d; // Retourne la distance en kilomètres.
-}
+const distance = (lat1, lon1, lat2, lon2) => {}
 
 /**
killedBy: findNearestToilet() should return the nearest toilet
statusReason: expected null to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Survived] ArithmeticOperator
src/CalculDistance.js:12:18
  */
 const distance = (lat1, lon1, lat2, lon2) => {
     const R = 6371; // Rayon de la Terre en kilomètres.
-    const dLat = (lat2 - lat1) * (Math.PI / 180); // Différence de latitude convertie en radians.
+    const dLat = (lat2 - lat1) / (Math.PI / 180); // Différence de latitude convertie en radians.
     const dLon = (lon2 - lon1) * (Math.PI / 180); // Différence de longitude convertie en radians.
     const a =

[Survived] ArithmeticOperator
src/CalculDistance.js:12:35
  */
 const distance = (lat1, lon1, lat2, lon2) => {
     const R = 6371; // Rayon de la Terre en kilomètres.
-    const dLat = (lat2 - lat1) * (Math.PI / 180); // Différence de latitude convertie en radians.
+    const dLat = (lat2 - lat1) * (Math.PI * 180); // Différence de latitude convertie en radians.
     const dLon = (lon2 - lon1) * (Math.PI / 180); // Différence de longitude convertie en radians.
     const a =

[Killed] ArithmeticOperator
src/CalculDistance.js:13:19
 const distance = (lat1, lon1, lat2, lon2) => {
     const R = 6371; // Rayon de la Terre en kilomètres.
     const dLat = (lat2 - lat1) * (Math.PI / 180); // Différence de latitude convertie en radians.
-    const dLon = (lon2 - lon1) * (Math.PI / 180); // Différence de longitude convertie en radians.
+    const dLon = (lon2 + lon1) * (Math.PI / 180); // Différence de longitude convertie en radians.
     const a =
         Math.sin(dLat / 2) * Math.sin(dLat / 2) +
killedBy: findNearestToilet() should return the nearest toilet
statusReason: expected { id: 2, latitude: 47.124, …(1) } to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Survived] ArithmeticOperator
src/CalculDistance.js:13:18
 const distance = (lat1, lon1, lat2, lon2) => {
     const R = 6371; // Rayon de la Terre en kilomètres.
     const dLat = (lat2 - lat1) * (Math.PI / 180); // Différence de latitude convertie en radians.
-    const dLon = (lon2 - lon1) * (Math.PI / 180); // Différence de longitude convertie en radians.
+    const dLon = (lon2 - lon1) / (Math.PI / 180); // Différence de longitude convertie en radians.
     const a =
         Math.sin(dLat / 2) * Math.sin(dLat / 2) +

[Killed] ArithmeticOperator
src/CalculDistance.js:15:9
     const dLat = (lat2 - lat1) * (Math.PI / 180); // Différence de latitude convertie en radians.
     const dLon = (lon2 - lon1) * (Math.PI / 180); // Différence de longitude convertie en radians.
     const a =
-        Math.sin(dLat / 2) * Math.sin(dLat / 2) +
+        Math.sin(dLat / 2) / Math.sin(dLat / 2) +
         Math.cos(lat1 * (Math.PI / 180)) * Math.cos(lat2 * (Math.PI / 180)) *
         Math.sin(dLon / 2) * Math.sin(dLon / 2); // Calcul de la formule de la distance haversine.
killedBy: findNearestToilet() should return the nearest toilet
statusReason: expected null to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Survived] ArithmeticOperator
src/CalculDistance.js:15:39
     const dLat = (lat2 - lat1) * (Math.PI / 180); // Différence de latitude convertie en radians.
     const dLon = (lon2 - lon1) * (Math.PI / 180); // Différence de longitude convertie en radians.
     const a =
-        Math.sin(dLat / 2) * Math.sin(dLat / 2) +
+        Math.sin(dLat / 2) * Math.sin(dLat * 2) +
         Math.cos(lat1 * (Math.PI / 180)) * Math.cos(lat2 * (Math.PI / 180)) *
         Math.sin(dLon / 2) * Math.sin(dLon / 2); // Calcul de la formule de la distance haversine.

[Killed] ArithmeticOperator
src/CalculDistance.js:16:9
     const dLon = (lon2 - lon1) * (Math.PI / 180); // Différence de longitude convertie en radians.
     const a =
         Math.sin(dLat / 2) * Math.sin(dLat / 2) +
-        Math.cos(lat1 * (Math.PI / 180)) * Math.cos(lat2 * (Math.PI / 180)) *
-        Math.sin(dLon / 2) * Math.sin(dLon / 2); // Calcul de la formule de la distance haversine.
+        Math.cos(lat1 * (Math.PI / 180)) * Math.cos(lat2 * (Math.PI / 180)) / Math.sin(dLon / 2) * Math.sin(dLon / 2); // Calcul de la formule de la distance haversine.
     const c = 2 * Math.atan2(Math.sqrt(a), Math.sqrt(1 - a)); // Calcul de l'angle central.
     const d = R * c; // Distance calculée en multipliant l'angle central par le rayon de la Terre.
killedBy: findNearestToilet() should return the nearest toilet
statusReason: expected { id: 4, latitude: 47.126, …(1) } to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Killed] ArithmeticOperator
src/CalculDistance.js:16:9
     const dLon = (lon2 - lon1) * (Math.PI / 180); // Différence de longitude convertie en radians.
     const a =
         Math.sin(dLat / 2) * Math.sin(dLat / 2) +
-        Math.cos(lat1 * (Math.PI / 180)) * Math.cos(lat2 * (Math.PI / 180)) *
-        Math.sin(dLon / 2) * Math.sin(dLon / 2); // Calcul de la formule de la distance haversine.
+        Math.cos(lat1 * (Math.PI / 180)) * Math.cos(lat2 * (Math.PI / 180)) * Math.sin(dLon / 2) / Math.sin(dLon / 2); // Calcul de la formule de la distance haversine.
     const c = 2 * Math.atan2(Math.sqrt(a), Math.sqrt(1 - a)); // Calcul de l'angle central.
     const d = R * c; // Distance calculée en multipliant l'angle central par le rayon de la Terre.
killedBy: findNearestToilet() should return the nearest toilet
statusReason: expected { id: 4, latitude: 47.126, …(1) } to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Survived] ArithmeticOperator
src/CalculDistance.js:17:18
     const a =
         Math.sin(dLat / 2) * Math.sin(dLat / 2) +
         Math.cos(lat1 * (Math.PI / 180)) * Math.cos(lat2 * (Math.PI / 180)) *
-        Math.sin(dLon / 2) * Math.sin(dLon / 2); // Calcul de la formule de la distance haversine.
+        Math.sin(dLon * 2) * Math.sin(dLon / 2); // Calcul de la formule de la distance haversine.
     const c = 2 * Math.atan2(Math.sqrt(a), Math.sqrt(1 - a)); // Calcul de l'angle central.
     const d = R * c; // Distance calculée en multipliant l'angle central par le rayon de la Terre.

[Survived] ArithmeticOperator
src/CalculDistance.js:17:39
     const a =
         Math.sin(dLat / 2) * Math.sin(dLat / 2) +
         Math.cos(lat1 * (Math.PI / 180)) * Math.cos(lat2 * (Math.PI / 180)) *
-        Math.sin(dLon / 2) * Math.sin(dLon / 2); // Calcul de la formule de la distance haversine.
+        Math.sin(dLon / 2) * Math.sin(dLon * 2); // Calcul de la formule de la distance haversine.
     const c = 2 * Math.atan2(Math.sqrt(a), Math.sqrt(1 - a)); // Calcul de l'angle central.
     const d = R * c; // Distance calculée en multipliant l'angle central par le rayon de la Terre.

[Killed] ArithmeticOperator
src/CalculDistance.js:18:15
         Math.sin(dLat / 2) * Math.sin(dLat / 2) +
         Math.cos(lat1 * (Math.PI / 180)) * Math.cos(lat2 * (Math.PI / 180)) *
         Math.sin(dLon / 2) * Math.sin(dLon / 2); // Calcul de la formule de la distance haversine.
-    const c = 2 * Math.atan2(Math.sqrt(a), Math.sqrt(1 - a)); // Calcul de l'angle central.
+    const c = 2 / Math.atan2(Math.sqrt(a), Math.sqrt(1 - a)); // Calcul de l'angle central.
     const d = R * c; // Distance calculée en multipliant l'angle central par le rayon de la Terre.
     return d; // Retourne la distance en kilomètres.
killedBy: findNearestToilet() should return the nearest toilet
statusReason: expected { id: 4, latitude: 47.126, …(1) } to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Survived] ArithmeticOperator
src/CalculDistance.js:18:54
         Math.sin(dLat / 2) * Math.sin(dLat / 2) +
         Math.cos(lat1 * (Math.PI / 180)) * Math.cos(lat2 * (Math.PI / 180)) *
         Math.sin(dLon / 2) * Math.sin(dLon / 2); // Calcul de la formule de la distance haversine.
-    const c = 2 * Math.atan2(Math.sqrt(a), Math.sqrt(1 - a)); // Calcul de l'angle central.
+    const c = 2 * Math.atan2(Math.sqrt(a), Math.sqrt(1 + a)); // Calcul de l'angle central.
     const d = R * c; // Distance calculée en multipliant l'angle central par le rayon de la Terre.
     return d; // Retourne la distance en kilomètres.

[Killed] ArithmeticOperator
src/CalculDistance.js:19:15
         Math.cos(lat1 * (Math.PI / 180)) * Math.cos(lat2 * (Math.PI / 180)) *
         Math.sin(dLon / 2) * Math.sin(dLon / 2); // Calcul de la formule de la distance haversine.
     const c = 2 * Math.atan2(Math.sqrt(a), Math.sqrt(1 - a)); // Calcul de l'angle central.
-    const d = R * c; // Distance calculée en multipliant l'angle central par le rayon de la Terre.
+    const d = R / c; // Distance calculée en multipliant l'angle central par le rayon de la Terre.
     return d; // Retourne la distance en kilomètres.
 }
killedBy: findNearestToilet() should return the nearest toilet
statusReason: expected { id: 4, latitude: 47.126, …(1) } to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Killed] BlockStatement
src/CalculDistance.js:31:54
  * @param {number} toilets[].longitude - Longitude de la toilette.
  * @returns {object|null} Les informations de la toilette la plus proche ou null s'il n'y a pas de toilettes.
  */
-const findNearestToilet = (userLocation, toilets) => {
-    if (userLocation[0] < -90 || userLocation[0] > 90 || userLocation[1] < -180 || userLocation[1] > 180){
-        throw Error("userLocation Invalid")
-    }
-    let nearestToilet = null; // Initialisation de la toilette la plus proche.
-    let minDistance = Infinity; // Initialisation de la distance minimale avec une valeur infinie.
-
-    // Parcours de la liste des toilettes.
-    toilets.forEach(toilet => {
-        // Calcul de la distance entre la position de l'utilisateur et la toilette actuelle.
-        const d = distance(userLocation[0], userLocation[1], toilet.latitude, toilet.longitude);
-        // Vérification si la distance calculée est inférieure à la distance minimale.
-        if (d < minDistance) {
-            minDistance = d; // Mise à jour de la distance minimale.
-            nearestToilet = toilet; // Mise à jour de la toilette la plus proche.
-        }
-    });
-
-    return nearestToilet; // Retourne les informations de la toilette la plus proche ou null.
-}
+const findNearestToilet = (userLocation, toilets) => {}
 
 //Même chose pour la findNearestToilet mais avec les stations de vélos.
killedBy: findNearestToilet() should return the nearest toilet
statusReason: expected undefined to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Killed] ConditionalExpression
src/CalculDistance.js:32:58
  * @returns {object|null} Les informations de la toilette la plus proche ou null s'il n'y a pas de toilettes.
  */
 const findNearestToilet = (userLocation, toilets) => {
-    if (userLocation[0] < -90 || userLocation[0] > 90 || userLocation[1] < -180 || userLocation[1] > 180){
+    if (userLocation[0] < -90 || userLocation[0] > 90 || false || userLocation[1] > 180){
         throw Error("userLocation Invalid")
     }
killedBy: findNearestToilet() should throw an error if userLocation is invalid (longitude out of range)
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/CalculDistance.js:32:9
  * @returns {object|null} Les informations de la toilette la plus proche ou null s'il n'y a pas de toilettes.
  */
 const findNearestToilet = (userLocation, toilets) => {
-    if (userLocation[0] < -90 || userLocation[0] > 90 || userLocation[1] < -180 || userLocation[1] > 180){
+    if ((userLocation[0] < -90 || userLocation[0] > 90) && userLocation[1] < -180 || userLocation[1] > 180){
         throw Error("userLocation Invalid")
     }
killedBy: findNearestToilet() should throw an error if userLocation is invalid (latitude out of range)
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/CalculDistance.js:33:21
  */
 const findNearestToilet = (userLocation, toilets) => {
     if (userLocation[0] < -90 || userLocation[0] > 90 || userLocation[1] < -180 || userLocation[1] > 180){
-        throw Error("userLocation Invalid")
+        throw Error("")
     }
     let nearestToilet = null; // Initialisation de la toilette la plus proche.
killedBy: findNearestToilet() should throw an error if userLocation is invalid (latitude out of range)
statusReason: expected [Function] to throw error including 'userLocation Invalid' but got ''

[Killed] BlockStatement
src/CalculDistance.js:39:31
     let minDistance = Infinity; // Initialisation de la distance minimale avec une valeur infinie.
 
     // Parcours de la liste des toilettes.
-    toilets.forEach(toilet => {
-        // Calcul de la distance entre la position de l'utilisateur et la toilette actuelle.
-        const d = distance(userLocation[0], userLocation[1], toilet.latitude, toilet.longitude);
-        // Vérification si la distance calculée est inférieure à la distance minimale.
-        if (d < minDistance) {
-            minDistance = d; // Mise à jour de la distance minimale.
-            nearestToilet = toilet; // Mise à jour de la toilette la plus proche.
-        }
-    });
+    toilets.forEach(toilet => {});
 
     return nearestToilet; // Retourne les informations de la toilette la plus proche ou null.
killedBy: findNearestToilet() should return the nearest toilet
statusReason: expected null to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Killed] ConditionalExpression
src/CalculDistance.js:43:13
         // Calcul de la distance entre la position de l'utilisateur et la toilette actuelle.
         const d = distance(userLocation[0], userLocation[1], toilet.latitude, toilet.longitude);
         // Vérification si la distance calculée est inférieure à la distance minimale.
-        if (d < minDistance) {
+        if (false) {
             minDistance = d; // Mise à jour de la distance minimale.
             nearestToilet = toilet; // Mise à jour de la toilette la plus proche.
killedBy: findNearestToilet() should return the nearest toilet
statusReason: expected null to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Killed] BlockStatement
src/CalculDistance.js:43:30
         // Calcul de la distance entre la position de l'utilisateur et la toilette actuelle.
         const d = distance(userLocation[0], userLocation[1], toilet.latitude, toilet.longitude);
         // Vérification si la distance calculée est inférieure à la distance minimale.
-        if (d < minDistance) {
-            minDistance = d; // Mise à jour de la distance minimale.
-            nearestToilet = toilet; // Mise à jour de la toilette la plus proche.
-        }
+        if (d < minDistance) {}
     });
 
killedBy: findNearestToilet() should return the nearest toilet
statusReason: expected null to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Killed] BlockStatement
src/CalculDistance.js:53:50
 }
 
 //Même chose pour la findNearestToilet mais avec les stations de vélos.
-const findNearestBike = (userLocation, bikes) => {
-    if (userLocation[0] < -90 || userLocation[0] > 90 || userLocation[1] < -180 || userLocation[1] > 180){
-        throw Error("userLocation Invalid")
-    }
-    let nearestBike = null;
-    let minDistance = Infinity;
-
-    bikes.forEach(bike => {
-        const d = distance(userLocation[0], userLocation[1], bike.latitude, bike.longitude);
-        if (d < minDistance) {
-            minDistance = d;
-            nearestBike = bike;
-        }
-    });
-
-    return nearestBike;
-}
+const findNearestBike = (userLocation, bikes) => {}
 
 module.exports = { findNearestToilet, findNearestBike };
killedBy: findNearestBike() should return the nearest bike
statusReason: expected undefined to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Killed] EqualityOperator
src/CalculDistance.js:54:34
 
 //Même chose pour la findNearestToilet mais avec les stations de vélos.
 const findNearestBike = (userLocation, bikes) => {
-    if (userLocation[0] < -90 || userLocation[0] > 90 || userLocation[1] < -180 || userLocation[1] > 180){
+    if (userLocation[0] < -90 || userLocation[0] <= 90 || userLocation[1] < -180 || userLocation[1] > 180){
         throw Error("userLocation Invalid")
     }
killedBy: findNearestBike() should return the nearest bike
statusReason: userLocation Invalid

[Killed] EqualityOperator
src/CalculDistance.js:54:9
 
 //Même chose pour la findNearestToilet mais avec les stations de vélos.
 const findNearestBike = (userLocation, bikes) => {
-    if (userLocation[0] < -90 || userLocation[0] > 90 || userLocation[1] < -180 || userLocation[1] > 180){
+    if (userLocation[0] >= -90 || userLocation[0] > 90 || userLocation[1] < -180 || userLocation[1] > 180){
         throw Error("userLocation Invalid")
     }
killedBy: findNearestBike() should return the nearest bike
statusReason: userLocation Invalid

[Killed] BlockStatement
src/CalculDistance.js:60:27
     let nearestBike = null;
     let minDistance = Infinity;
 
-    bikes.forEach(bike => {
-        const d = distance(userLocation[0], userLocation[1], bike.latitude, bike.longitude);
-        if (d < minDistance) {
-            minDistance = d;
-            nearestBike = bike;
-        }
-    });
+    bikes.forEach(bike => {});
 
     return nearestBike;
killedBy: findNearestBike() should return the nearest bike
statusReason: expected null to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Killed] BlockStatement
src/CalculDistance.js:62:30
 
     bikes.forEach(bike => {
         const d = distance(userLocation[0], userLocation[1], bike.latitude, bike.longitude);
-        if (d < minDistance) {
-            minDistance = d;
-            nearestBike = bike;
-        }
+        if (d < minDistance) {}
     });
 
killedBy: findNearestBike() should return the nearest bike
statusReason: expected null to deeply equal { id: 1, latitude: 47.1235, …(1) }

[Killed] ConditionalExpression
src/CalculDistance.js:62:13
 
     bikes.forEach(bike => {
         const d = distance(userLocation[0], userLocation[1], bike.latitude, bike.longitude);
-        if (d < minDistance) {
+        if (false) {
             minDistance = d;
             nearestBike = bike;
killedBy: findNearestBike() should return the nearest bike
statusReason: expected null to deeply equal { id: 1, latitude: 47.1235, …(1) }
